CREATE TABLE pokemon_names
(
    pokemon_id INTEGER NOT NULL,
    language_id TEXT NOT NULL,
    `name` TEXT UNIQUE NOT NULL,
    PRIMARY KEY(pokemon_id, language_id)
);

INSERT INTO pokemon_names
    (pokemon_id, language_id, `name`)
VALUES
    (         1, 'ja'       , 'フシギダネ'),
    (         1, 'en'       , 'Bulbasaur'),
    (         2, 'ja'       , 'フシギソウ'),
    (         2, 'en'       , 'Ivysaur'),
    (         3, 'ja'       , 'フシギバナ'),
    (         3, 'en'       , 'Venusaur'),
    (         4, 'ja'       , 'ヒトカゲ'),
    (         4, 'en'       , 'Charmander'),
    (         5, 'ja'       , 'リザード'),
    (         5, 'en'       , 'Charmeleon'),
    (         6, 'ja'       , 'リザードン'),
    (         6, 'en'       , 'Charizard'),
    (         7, 'ja'       , 'ゼニガメ'),
    (         7, 'en'       , 'Squirtle'),
    (         8, 'ja'       , 'カメール'),
    (         8, 'en'       , 'Wartortle'),
    (         9, 'ja'       , 'カメックス'),
    (         9, 'en'       , 'Blastoise'),
    (        10, 'ja'       , 'キャタピー'),
    (        10, 'en'       , 'Caterpie'),
    (        11, 'ja'       , 'トランセル'),
    (        11, 'en'       , 'Metapod'),
    (        12, 'ja'       , 'バタフリー'),
    (        12, 'en'       , 'Butterfree'),
    (        13, 'ja'       , 'ビードル'),
    (        13, 'en'       , 'Weedle'),
    (        14, 'ja'       , 'コクーン'),
    (        14, 'en'       , 'Kakuna'),
    (        15, 'ja'       , 'スピアー'),
    (        15, 'en'       , 'Beedrill'),
    (        16, 'ja'       , 'ポッポ'),
    (        16, 'en'       , 'Pidgey'),
    (        17, 'ja'       , 'ピジョン'),
    (        17, 'en'       , 'Pidgeotto'),
    (        18, 'ja'       , 'ピジョット'),
    (        18, 'en'       , 'Pidgeot'),
    (        19, 'ja'       , 'コラッタ'),
    (        19, 'en'       , 'Rattata'),
    (        20, 'ja'       , 'ラッタ'),
    (        20, 'en'       , 'Raticate'),
    (        21, 'ja'       , 'オニスズメ'),
    (        21, 'en'       , 'Spearow'),
    (        22, 'ja'       , 'オニドリル'),
    (        22, 'en'       , 'Fearow'),
    (        23, 'ja'       , 'アーボ'),
    (        23, 'en'       , 'Ekans'),
    (        24, 'ja'       , 'アーボック'),
    (        24, 'en'       , 'Arbok'),
    (        25, 'ja'       , 'ピカチュウ'),
    (        25, 'en'       , 'Pikachu'),
    (        26, 'ja'       , 'ライチュウ'),
    (        26, 'en'       , 'Raichu'),
    (        27, 'ja'       , 'サンド'),
    (        27, 'en'       , 'Sandshrew'),
    (        28, 'ja'       , 'サンドパン'),
    (        28, 'en'       , 'Sandslash'),
    (        29, 'ja'       , 'ニドラン♀'),
    (        29, 'en'       , 'Nidoran♀'),
    (        30, 'ja'       , 'ニドリーナ'),
    (        30, 'en'       , 'Nidorina'),
    (        31, 'ja'       , 'ニドクイン'),
    (        31, 'en'       , 'Nidoqueen'),
    (        32, 'ja'       , 'ニドラン♂'),
    (        32, 'en'       , 'Nidoran♂'),
    (        33, 'ja'       , 'ニドリーノ'),
    (        33, 'en'       , 'Nidorino'),
    (        34, 'ja'       , 'ニドキング'),
    (        34, 'en'       , 'Nidoking'),
    (        35, 'ja'       , 'ピッピ'),
    (        35, 'en'       , 'Clefairy'),
    (        36, 'ja'       , 'ピクシー'),
    (        36, 'en'       , 'Clefable'),
    (        37, 'ja'       , 'ロコン'),
    (        37, 'en'       , 'Vulpix'),
    (        38, 'ja'       , 'キュウコン'),
    (        38, 'en'       , 'Ninetales'),
    (        39, 'ja'       , 'プリン'),
    (        39, 'en'       , 'Jigglypuff'),
    (        40, 'ja'       , 'プクリン'),
    (        40, 'en'       , 'Wigglytuff'),
    (        41, 'ja'       , 'ズバット'),
    (        41, 'en'       , 'Zubat'),
    (        42, 'ja'       , 'ゴルバット'),
    (        42, 'en'       , 'Golbat'),
    (        43, 'ja'       , 'ナゾノクサ'),
    (        43, 'en'       , 'Oddish'),
    (        44, 'ja'       , 'クサイハナ'),
    (        44, 'en'       , 'Gloom'),
    (        45, 'ja'       , 'ラフレシア'),
    (        45, 'en'       , 'Vileplume'),
    (        46, 'ja'       , 'パラス'),
    (        46, 'en'       , 'Paras'),
    (        47, 'ja'       , 'パラセクト'),
    (        47, 'en'       , 'Parasect'),
    (        48, 'ja'       , 'コンパン'),
    (        48, 'en'       , 'Venonat'),
    (        49, 'ja'       , 'モルフォン'),
    (        49, 'en'       , 'Venomoth'),
    (        50, 'ja'       , 'ディグダ'),
    (        50, 'en'       , 'Diglett'),
    (        51, 'ja'       , 'ダグトリオ'),
    (        51, 'en'       , 'Dugtrio'),
    (        52, 'ja'       , 'ニャース'),
    (        52, 'en'       , 'Meowth'),
    (        53, 'ja'       , 'ペルシアン'),
    (        53, 'en'       , 'Persian'),
    (        54, 'ja'       , 'コダック'),
    (        54, 'en'       , 'Psyduck'),
    (        55, 'ja'       , 'ゴルダック'),
    (        55, 'en'       , 'Golduck'),
    (        56, 'ja'       , 'マンキー'),
    (        56, 'en'       , 'Mankey'),
    (        57, 'ja'       , 'オコリザル'),
    (        57, 'en'       , 'Primeape'),
    (        58, 'ja'       , 'ガーディ'),
    (        58, 'en'       , 'Growlithe'),
    (        59, 'ja'       , 'ウインディ'),
    (        59, 'en'       , 'Arcanine'),
    (        60, 'ja'       , 'ニョロモ'),
    (        60, 'en'       , 'Poliwag'),
    (        61, 'ja'       , 'ニョロゾ'),
    (        61, 'en'       , 'Poliwhirl'),
    (        62, 'ja'       , 'ニョロボン'),
    (        62, 'en'       , 'Poliwrath'),
    (        63, 'ja'       , 'ケーシィ'),
    (        63, 'en'       , 'Abra'),
    (        64, 'ja'       , 'ユンゲラー'),
    (        64, 'en'       , 'Kadabra'),
    (        65, 'ja'       , 'フーディン'),
    (        65, 'en'       , 'Alakazam'),
    (        66, 'ja'       , 'ワンリキー'),
    (        66, 'en'       , 'Machop'),
    (        67, 'ja'       , 'ゴーリキー'),
    (        67, 'en'       , 'Machoke'),
    (        68, 'ja'       , 'カイリキー'),
    (        68, 'en'       , 'Machamp'),
    (        69, 'ja'       , 'マダツボミ'),
    (        69, 'en'       , 'Bellsprout'),
    (        70, 'ja'       , 'ウツドン'),
    (        70, 'en'       , 'Weepinbell'),
    (        71, 'ja'       , 'ウツボット'),
    (        71, 'en'       , 'Victreebel'),
    (        72, 'ja'       , 'メノクラゲ'),
    (        72, 'en'       , 'Tentacool'),
    (        73, 'ja'       , 'ドククラゲ'),
    (        73, 'en'       , 'Tentacruel'),
    (        74, 'ja'       , 'イシツブテ'),
    (        74, 'en'       , 'Geodude'),
    (        75, 'ja'       , 'ゴローン'),
    (        75, 'en'       , 'Graveler'),
    (        76, 'ja'       , 'ゴローニャ'),
    (        76, 'en'       , 'Golem'),
    (        77, 'ja'       , 'ポニータ'),
    (        77, 'en'       , 'Ponyta'),
    (        78, 'ja'       , 'ギャロップ'),
    (        78, 'en'       , 'Rapidash'),
    (        79, 'ja'       , 'ヤドン'),
    (        79, 'en'       , 'Slowpoke'),
    (        80, 'ja'       , 'ヤドラン'),
    (        80, 'en'       , 'Slowbro'),
    (        81, 'ja'       , 'コイル'),
    (        81, 'en'       , 'Magnemite'),
    (        82, 'ja'       , 'レアコイル'),
    (        82, 'en'       , 'Magneton'),
    (        83, 'ja'       , 'カモネギ'),
    (        83, 'en'       , "Farfetch'd"),
    (        84, 'ja'       , 'ドードー'),
    (        84, 'en'       , 'Doduo'),
    (        85, 'ja'       , 'ドードリオ'),
    (        85, 'en'       , 'Dodrio'),
    (        86, 'ja'       , 'パウワウ'),
    (        86, 'en'       , 'Seel'),
    (        87, 'ja'       , 'ジュゴン'),
    (        87, 'en'       , 'Dewgong'),
    (        88, 'ja'       , 'ベトベター'),
    (        88, 'en'       , 'Grimer'),
    (        89, 'ja'       , 'ベトベトン'),
    (        89, 'en'       , 'Muk'),
    (        90, 'ja'       , 'シェルダー'),
    (        90, 'en'       , 'Shellder'),
    (        91, 'ja'       , 'パルシェン'),
    (        91, 'en'       , 'Cloyster'),
    (        92, 'ja'       , 'ゴース'),
    (        92, 'en'       , 'Gastly'),
    (        93, 'ja'       , 'ゴースト'),
    (        93, 'en'       , 'Haunter'),
    (        94, 'ja'       , 'ゲンガー'),
    (        94, 'en'       , 'Gengar'),
    (        95, 'ja'       , 'イワーク'),
    (        95, 'en'       , 'Onix'),
    (        96, 'ja'       , 'スリープ'),
    (        96, 'en'       , 'Drowzee'),
    (        97, 'ja'       , 'スリーパー'),
    (        97, 'en'       , 'Hypno'),
    (        98, 'ja'       , 'クラブ'),
    (        98, 'en'       , 'Krabby'),
    (        99, 'ja'       , 'キングラー'),
    (        99, 'en'       , 'Kingler'),
    (       100, 'ja'       , 'ビリリダマ'),
    (       100, 'en'       , 'Voltorb'),
    (       101, 'ja'       , 'マルマイン'),
    (       101, 'en'       , 'Electrode'),
    (       102, 'ja'       , 'タマタマ'),
    (       102, 'en'       , 'Exeggcute'),
    (       103, 'ja'       , 'ナッシー'),
    (       103, 'en'       , 'Exeggutor'),
    (       104, 'ja'       , 'カラカラ'),
    (       104, 'en'       , 'Cubone'),
    (       105, 'ja'       , 'ガラガラ'),
    (       105, 'en'       , 'Marowak'),
    (       106, 'ja'       , 'サワムラー'),
    (       106, 'en'       , 'Hitmonlee'),
    (       107, 'ja'       , 'エビワラー'),
    (       107, 'en'       , 'Hitmonchan'),
    (       108, 'ja'       , 'ベロリンガ'),
    (       108, 'en'       , 'Lickitung'),
    (       109, 'ja'       , 'ドガース'),
    (       109, 'en'       , 'Koffing'),
    (       110, 'ja'       , 'マタドガス'),
    (       110, 'en'       , 'Weezing'),
    (       111, 'ja'       , 'サイホーン'),
    (       111, 'en'       , 'Rhyhorn'),
    (       112, 'ja'       , 'サイドン'),
    (       112, 'en'       , 'Rhydon'),
    (       113, 'ja'       , 'ラッキー'),
    (       113, 'en'       , 'Chansey'),
    (       114, 'ja'       , 'モンジャラ'),
    (       114, 'en'       , 'Tangela'),
    (       115, 'ja'       , 'ガルーラ'),
    (       115, 'en'       , 'Kangaskhan'),
    (       116, 'ja'       , 'タッツー'),
    (       116, 'en'       , 'Horsea'),
    (       117, 'ja'       , 'シードラ'),
    (       117, 'en'       , 'Seadra'),
    (       118, 'ja'       , 'トサキント'),
    (       118, 'en'       , 'Goldeen'),
    (       119, 'ja'       , 'アズマオウ'),
    (       119, 'en'       , 'Seaking'),
    (       120, 'ja'       , 'ヒトデマン'),
    (       120, 'en'       , 'Staryu'),
    (       121, 'ja'       , 'スターミー'),
    (       121, 'en'       , 'Starmie'),
    (       122, 'ja'       , 'バリヤード'),
    (       122, 'en'       , 'Mr. Mime'),
    (       123, 'ja'       , 'ストライク'),
    (       123, 'en'       , 'Scyther'),
    (       124, 'ja'       , 'ルージュラ'),
    (       124, 'en'       , 'Jynx'),
    (       125, 'ja'       , 'エレブー'),
    (       125, 'en'       , 'Electabuzz'),
    (       126, 'ja'       , 'ブーバー'),
    (       126, 'en'       , 'Magmar'),
    (       127, 'ja'       , 'カイロス'),
    (       127, 'en'       , 'Pinsir'),
    (       128, 'ja'       , 'ケンタロス'),
    (       128, 'en'       , 'Tauros'),
    (       129, 'ja'       , 'コイキング'),
    (       129, 'en'       , 'Magikarp'),
    (       130, 'ja'       , 'ギャラドス'),
    (       130, 'en'       , 'Gyarados'),
    (       131, 'ja'       , 'ラプラス'),
    (       131, 'en'       , 'Lapras'),
    (       132, 'ja'       , 'メタモン'),
    (       132, 'en'       , 'Ditto'),
    (       133, 'ja'       , 'イーブイ'),
    (       133, 'en'       , 'Eevee'),
    (       134, 'ja'       , 'シャワーズ'),
    (       134, 'en'       , 'Vaporeon'),
    (       135, 'ja'       , 'サンダース'),
    (       135, 'en'       , 'Jolteon'),
    (       136, 'ja'       , 'ブースター'),
    (       136, 'en'       , 'Flareon'),
    (       137, 'ja'       , 'ポリゴン'),
    (       137, 'en'       , 'Porygon'),
    (       138, 'ja'       , 'オムナイト'),
    (       138, 'en'       , 'Omanyte'),
    (       139, 'ja'       , 'オムスター'),
    (       139, 'en'       , 'Omastar'),
    (       140, 'ja'       , 'カブト'),
    (       140, 'en'       , 'Kabuto'),
    (       141, 'ja'       , 'カブトプス'),
    (       141, 'en'       , 'Kabutops'),
    (       142, 'ja'       , 'プテラ'),
    (       142, 'en'       , 'Aerodactyl'),
    (       143, 'ja'       , 'カビゴン'),
    (       143, 'en'       , 'Snorlax'),
    (       144, 'ja'       , 'フリーザー'),
    (       144, 'en'       , 'Articuno'),
    (       145, 'ja'       , 'サンダー'),
    (       145, 'en'       , 'Zapdos'),
    (       146, 'ja'       , 'ファイヤー'),
    (       146, 'en'       , 'Moltres'),
    (       147, 'ja'       , 'ミニリュウ'),
    (       147, 'en'       , 'Dratini'),
    (       148, 'ja'       , 'ハクリュー'),
    (       148, 'en'       , 'Dragonair'),
    (       149, 'ja'       , 'カイリュー'),
    (       149, 'en'       , 'Dragonite'),
    (       150, 'ja'       , 'ミュウツー'),
    (       150, 'en'       , 'Mewtwo'),
    (       151, 'ja'       , 'ミュウ'),
    (       151, 'en'       , 'Mew'),
    (       152, 'ja'       , 'チコリータ'),
    (       152, 'en'       , 'Chikorita'),
    (       153, 'ja'       , 'ベイリーフ'),
    (       153, 'en'       , 'Bayleef'),
    (       154, 'ja'       , 'メガニウム'),
    (       154, 'en'       , 'Meganium'),
    (       155, 'ja'       , 'ヒノアラシ'),
    (       155, 'en'       , 'Cyndaquil'),
    (       156, 'ja'       , 'マグマラシ'),
    (       156, 'en'       , 'Quilava'),
    (       157, 'ja'       , 'バクフーン'),
    (       157, 'en'       , 'Typhlosion'),
    (       158, 'ja'       , 'ワニノコ'),
    (       158, 'en'       , 'Totodile'),
    (       159, 'ja'       , 'アリゲイツ'),
    (       159, 'en'       , 'Croconaw'),
    (       160, 'ja'       , 'オーダイル'),
    (       160, 'en'       , 'Feraligatr'),
    (       161, 'ja'       , 'オタチ'),
    (       161, 'en'       , 'Sentret'),
    (       162, 'ja'       , 'オオタチ'),
    (       162, 'en'       , 'Furret'),
    (       163, 'ja'       , 'ホーホー'),
    (       163, 'en'       , 'Hoothoot'),
    (       164, 'ja'       , 'ヨルノズク'),
    (       164, 'en'       , 'Noctowl'),
    (       165, 'ja'       , 'レディバ'),
    (       165, 'en'       , 'Ledyba'),
    (       166, 'ja'       , 'レディアン'),
    (       166, 'en'       , 'Ledian'),
    (       167, 'ja'       , 'イトマル'),
    (       167, 'en'       , 'Spinarak'),
    (       168, 'ja'       , 'アリアドス'),
    (       168, 'en'       , 'Ariados'),
    (       169, 'ja'       , 'クロバット'),
    (       169, 'en'       , 'Crobat'),
    (       170, 'ja'       , 'チョンチー'),
    (       170, 'en'       , 'Chinchou'),
    (       171, 'ja'       , 'ランターン'),
    (       171, 'en'       , 'Lanturn'),
    (       172, 'ja'       , 'ピチュー'),
    (       172, 'en'       , 'Pichu'),
    (       173, 'ja'       , 'ピィ'),
    (       173, 'en'       , 'Cleffa'),
    (       174, 'ja'       , 'ププリン'),
    (       174, 'en'       , 'Igglybuff'),
    (       175, 'ja'       , 'トゲピー'),
    (       175, 'en'       , 'Togepi'),
    (       176, 'ja'       , 'トゲチック'),
    (       176, 'en'       , 'Togetic'),
    (       177, 'ja'       , 'ネイティ'),
    (       177, 'en'       , 'Natu'),
    (       178, 'ja'       , 'ネイティオ'),
    (       178, 'en'       , 'Xatu'),
    (       179, 'ja'       , 'メリープ'),
    (       179, 'en'       , 'Mareep'),
    (       180, 'ja'       , 'モココ'),
    (       180, 'en'       , 'Flaaffy'),
    (       181, 'ja'       , 'デンリュウ'),
    (       181, 'en'       , 'Ampharos'),
    (       182, 'ja'       , 'キレイハナ'),
    (       182, 'en'       , 'Bellossom'),
    (       183, 'ja'       , 'マリル'),
    (       183, 'en'       , 'Marill'),
    (       184, 'ja'       , 'マリルリ'),
    (       184, 'en'       , 'Azumarill'),
    (       185, 'ja'       , 'ウソッキー'),
    (       185, 'en'       , 'Sudowoodo'),
    (       186, 'ja'       , 'ニョロトノ'),
    (       186, 'en'       , 'Politoed'),
    (       187, 'ja'       , 'ハネッコ'),
    (       187, 'en'       , 'Hoppip'),
    (       188, 'ja'       , 'ポポッコ'),
    (       188, 'en'       , 'Skiploom'),
    (       189, 'ja'       , 'ワタッコ'),
    (       189, 'en'       , 'Jumpluff'),
    (       190, 'ja'       , 'エイパム'),
    (       190, 'en'       , 'Aipom'),
    (       191, 'ja'       , 'ヒマナッツ'),
    (       191, 'en'       , 'Sunkern'),
    (       192, 'ja'       , 'キマワリ'),
    (       192, 'en'       , 'Sunflora'),
    (       193, 'ja'       , 'ヤンヤンマ'),
    (       193, 'en'       , 'Yanma'),
    (       194, 'ja'       , 'ウパー'),
    (       194, 'en'       , 'Wooper'),
    (       195, 'ja'       , 'ヌオー'),
    (       195, 'en'       , 'Quagsire'),
    (       196, 'ja'       , 'エーフィ'),
    (       196, 'en'       , 'Espeon'),
    (       197, 'ja'       , 'ブラッキー'),
    (       197, 'en'       , 'Umbreon'),
    (       198, 'ja'       , 'ヤミカラス'),
    (       198, 'en'       , 'Murkrow'),
    (       199, 'ja'       , 'ヤドキング'),
    (       199, 'en'       , 'Slowking'),
    (       200, 'ja'       , 'ムウマ'),
    (       200, 'en'       , 'Misdreavus'),
    (       201, 'ja'       , 'アンノーン'),
    (       201, 'en'       , 'Unown'),
    (       202, 'ja'       , 'ソーナンス'),
    (       202, 'en'       , 'Wobbuffet'),
    (       203, 'ja'       , 'キリンリキ'),
    (       203, 'en'       , 'Girafarig'),
    (       204, 'ja'       , 'クヌギダマ'),
    (       204, 'en'       , 'Pineco'),
    (       205, 'ja'       , 'フォレトス'),
    (       205, 'en'       , 'Forretress'),
    (       206, 'ja'       , 'ノコッチ'),
    (       206, 'en'       , 'Dunsparce'),
    (       207, 'ja'       , 'グライガー'),
    (       207, 'en'       , 'Gligar'),
    (       208, 'ja'       , 'ハガネール'),
    (       208, 'en'       , 'Steelix'),
    (       209, 'ja'       , 'ブルー'),
    (       209, 'en'       , 'Snubbull'),
    (       210, 'ja'       , 'グランブル'),
    (       210, 'en'       , 'Granbull'),
    (       211, 'ja'       , 'ハリーセン'),
    (       211, 'en'       , 'Qwilfish'),
    (       212, 'ja'       , 'ハッサム'),
    (       212, 'en'       , 'Scizor'),
    (       213, 'ja'       , 'ツボツボ'),
    (       213, 'en'       , 'Shuckle'),
    (       214, 'ja'       , 'ヘラクロス'),
    (       214, 'en'       , 'Heracross'),
    (       215, 'ja'       , 'ニューラ'),
    (       215, 'en'       , 'Sneasel'),
    (       216, 'ja'       , 'ヒメグマ'),
    (       216, 'en'       , 'Teddiursa'),
    (       217, 'ja'       , 'リングマ'),
    (       217, 'en'       , 'Ursaring'),
    (       218, 'ja'       , 'マグマッグ'),
    (       218, 'en'       , 'Slugma'),
    (       219, 'ja'       , 'マグカルゴ'),
    (       219, 'en'       , 'Magcargo'),
    (       220, 'ja'       , 'ウリムー'),
    (       220, 'en'       , 'Swinub'),
    (       221, 'ja'       , 'イノムー'),
    (       221, 'en'       , 'Piloswine'),
    (       222, 'ja'       , 'サニーゴ'),
    (       222, 'en'       , 'Corsola'),
    (       223, 'ja'       , 'テッポウオ'),
    (       223, 'en'       , 'Remoraid'),
    (       224, 'ja'       , 'オクタン'),
    (       224, 'en'       , 'Octillery'),
    (       225, 'ja'       , 'デリバード'),
    (       225, 'en'       , 'Delibird'),
    (       226, 'ja'       , 'マンタイン'),
    (       226, 'en'       , 'Mantine'),
    (       227, 'ja'       , 'エアームド'),
    (       227, 'en'       , 'Skarmory'),
    (       228, 'ja'       , 'デルビル'),
    (       228, 'en'       , 'Houndour'),
    (       229, 'ja'       , 'ヘルガー'),
    (       229, 'en'       , 'Houndoom'),
    (       230, 'ja'       , 'キングドラ'),
    (       230, 'en'       , 'Kingdra'),
    (       231, 'ja'       , 'ゴマゾウ'),
    (       231, 'en'       , 'Phanpy'),
    (       232, 'ja'       , 'ドンファン'),
    (       232, 'en'       , 'Donphan'),
    (       233, 'ja'       , 'ポリゴン２'),
    (       233, 'en'       , 'Porygon2'),
    (       234, 'ja'       , 'オドシシ'),
    (       234, 'en'       , 'Stantler'),
    (       235, 'ja'       , 'ドーブル'),
    (       235, 'en'       , 'Smeargle'),
    (       236, 'ja'       , 'バルキー'),
    (       236, 'en'       , 'Tyrogue'),
    (       237, 'ja'       , 'カポエラー'),
    (       237, 'en'       , 'Hitmontop'),
    (       238, 'ja'       , 'ムチュール'),
    (       238, 'en'       , 'Smoochum'),
    (       239, 'ja'       , 'エレキッド'),
    (       239, 'en'       , 'Elekid'),
    (       240, 'ja'       , 'ブビィ'),
    (       240, 'en'       , 'Magby'),
    (       241, 'ja'       , 'ミルタンク'),
    (       241, 'en'       , 'Miltank'),
    (       242, 'ja'       , 'ハピナス'),
    (       242, 'en'       , 'Blissey'),
    (       243, 'ja'       , 'ライコウ'),
    (       243, 'en'       , 'Raikou'),
    (       244, 'ja'       , 'エンテイ'),
    (       244, 'en'       , 'Entei'),
    (       245, 'ja'       , 'スイクン'),
    (       245, 'en'       , 'Suicune'),
    (       246, 'ja'       , 'ヨーギラス'),
    (       246, 'en'       , 'Larvitar'),
    (       247, 'ja'       , 'サナギラス'),
    (       247, 'en'       , 'Pupitar'),
    (       248, 'ja'       , 'バンギラス'),
    (       248, 'en'       , 'Tyranitar'),
    (       249, 'ja'       , 'ルギア'),
    (       249, 'en'       , 'Lugia'),
    (       250, 'ja'       , 'ホウオウ'),
    (       250, 'en'       , 'Ho-Oh'),
    (       251, 'ja'       , 'セレビィ'),
    (       251, 'en'       , 'Celebi'),
    (       252, 'ja'       , 'キモリ'),
    (       252, 'en'       , 'Treecko'),
    (       253, 'ja'       , 'ジュプトル'),
    (       253, 'en'       , 'Grovyle'),
    (       254, 'ja'       , 'ジュカイン'),
    (       254, 'en'       , 'Sceptile'),
    (       255, 'ja'       , 'アチャモ'),
    (       255, 'en'       , 'Torchic'),
    (       256, 'ja'       , 'ワカシャモ'),
    (       256, 'en'       , 'Combusken'),
    (       257, 'ja'       , 'バシャーモ'),
    (       257, 'en'       , 'Blaziken'),
    (       258, 'ja'       , 'ミズゴロウ'),
    (       258, 'en'       , 'Mudkip'),
    (       259, 'ja'       , 'ヌマクロー'),
    (       259, 'en'       , 'Marshtomp'),
    (       260, 'ja'       , 'ラグラージ'),
    (       260, 'en'       , 'Swampert'),
    (       261, 'ja'       , 'ポチエナ'),
    (       261, 'en'       , 'Poochyena'),
    (       262, 'ja'       , 'グラエナ'),
    (       262, 'en'       , 'Mightyena'),
    (       263, 'ja'       , 'ジグザグマ'),
    (       263, 'en'       , 'Zigzagoon'),
    (       264, 'ja'       , 'マッスグマ'),
    (       264, 'en'       , 'Linoone'),
    (       265, 'ja'       , 'ケムッソ'),
    (       265, 'en'       , 'Wurmple'),
    (       266, 'ja'       , 'カラサリス'),
    (       266, 'en'       , 'Silcoon'),
    (       267, 'ja'       , 'アゲハント'),
    (       267, 'en'       , 'Beautifly'),
    (       268, 'ja'       , 'マユルド'),
    (       268, 'en'       , 'Cascoon'),
    (       269, 'ja'       , 'ドクケイル'),
    (       269, 'en'       , 'Dustox'),
    (       270, 'ja'       , 'ハスボー'),
    (       270, 'en'       , 'Lotad'),
    (       271, 'ja'       , 'ハスブレロ'),
    (       271, 'en'       , 'Lombre'),
    (       272, 'ja'       , 'ルンパッパ'),
    (       272, 'en'       , 'Ludicolo'),
    (       273, 'ja'       , 'タネボー'),
    (       273, 'en'       , 'Seedot'),
    (       274, 'ja'       , 'コノハナ'),
    (       274, 'en'       , 'Nuzleaf'),
    (       275, 'ja'       , 'ダーテング'),
    (       275, 'en'       , 'Shiftry'),
    (       276, 'ja'       , 'スバメ'),
    (       276, 'en'       , 'Taillow'),
    (       277, 'ja'       , 'オオスバメ'),
    (       277, 'en'       , 'Swellow'),
    (       278, 'ja'       , 'キャモメ'),
    (       278, 'en'       , 'Wingull'),
    (       279, 'ja'       , 'ペリッパー'),
    (       279, 'en'       , 'Pelipper'),
    (       280, 'ja'       , 'ラルトス'),
    (       280, 'en'       , 'Ralts'),
    (       281, 'ja'       , 'キルリア'),
    (       281, 'en'       , 'Kirlia'),
    (       282, 'ja'       , 'サーナイト'),
    (       282, 'en'       , 'Gardevoir'),
    (       283, 'ja'       , 'アメタマ'),
    (       283, 'en'       , 'Surskit'),
    (       284, 'ja'       , 'アメモース'),
    (       284, 'en'       , 'Masquerain'),
    (       285, 'ja'       , 'キノココ'),
    (       285, 'en'       , 'Shroomish'),
    (       286, 'ja'       , 'キノガッサ'),
    (       286, 'en'       , 'Breloom'),
    (       287, 'ja'       , 'ナマケロ'),
    (       287, 'en'       , 'Slakoth'),
    (       288, 'ja'       , 'ヤルキモノ'),
    (       288, 'en'       , 'Vigoroth'),
    (       289, 'ja'       , 'ケッキング'),
    (       289, 'en'       , 'Slaking'),
    (       290, 'ja'       , 'ツチニン'),
    (       290, 'en'       , 'Nincada'),
    (       291, 'ja'       , 'テッカニン'),
    (       291, 'en'       , 'Ninjask'),
    (       292, 'ja'       , 'ヌケニン'),
    (       292, 'en'       , 'Shedinja'),
    (       293, 'ja'       , 'ゴニョニョ'),
    (       293, 'en'       , 'Whismur'),
    (       294, 'ja'       , 'ドゴーム'),
    (       294, 'en'       , 'Loudred'),
    (       295, 'ja'       , 'バクオング'),
    (       295, 'en'       , 'Exploud'),
    (       296, 'ja'       , 'マクノシタ'),
    (       296, 'en'       , 'Makuhita'),
    (       297, 'ja'       , 'ハリテヤマ'),
    (       297, 'en'       , 'Hariyama'),
    (       298, 'ja'       , 'ルリリ'),
    (       298, 'en'       , 'Azurill'),
    (       299, 'ja'       , 'ノズパス'),
    (       299, 'en'       , 'Nosepass'),
    (       300, 'ja'       , 'エネコ'),
    (       300, 'en'       , 'Skitty'),
    (       301, 'ja'       , 'エネコロロ'),
    (       301, 'en'       , 'Delcatty'),
    (       302, 'ja'       , 'ヤミラミ'),
    (       302, 'en'       , 'Sableye'),
    (       303, 'ja'       , 'クチート'),
    (       303, 'en'       , 'Mawile'),
    (       304, 'ja'       , 'ココドラ'),
    (       304, 'en'       , 'Aron'),
    (       305, 'ja'       , 'コドラ'),
    (       305, 'en'       , 'Lairon'),
    (       306, 'ja'       , 'ボスゴドラ'),
    (       306, 'en'       , 'Aggron'),
    (       307, 'ja'       , 'アサナン'),
    (       307, 'en'       , 'Meditite'),
    (       308, 'ja'       , 'チャーレム'),
    (       308, 'en'       , 'Medicham'),
    (       309, 'ja'       , 'ラクライ'),
    (       309, 'en'       , 'Electrike'),
    (       310, 'ja'       , 'ライボルト'),
    (       310, 'en'       , 'Manectric'),
    (       311, 'ja'       , 'プラスル'),
    (       311, 'en'       , 'Plusle'),
    (       312, 'ja'       , 'マイナン'),
    (       312, 'en'       , 'Minun'),
    (       313, 'ja'       , 'バルビート'),
    (       313, 'en'       , 'Volbeat'),
    (       314, 'ja'       , 'イルミーゼ'),
    (       314, 'en'       , 'Illumise'),
    (       315, 'ja'       , 'ロゼリア'),
    (       315, 'en'       , 'Roselia'),
    (       316, 'ja'       , 'ゴクリン'),
    (       316, 'en'       , 'Gulpin'),
    (       317, 'ja'       , 'マルノーム'),
    (       317, 'en'       , 'Swalot'),
    (       318, 'ja'       , 'キバニア'),
    (       318, 'en'       , 'Carvanha'),
    (       319, 'ja'       , 'サメハダー'),
    (       319, 'en'       , 'Sharpedo'),
    (       320, 'ja'       , 'ホエルコ'),
    (       320, 'en'       , 'Wailmer'),
    (       321, 'ja'       , 'ホエルオー'),
    (       321, 'en'       , 'Wailord'),
    (       322, 'ja'       , 'ドンメル'),
    (       322, 'en'       , 'Numel'),
    (       323, 'ja'       , 'バクーダ'),
    (       323, 'en'       , 'Camerupt'),
    (       324, 'ja'       , 'コータス'),
    (       324, 'en'       , 'Torkoal'),
    (       325, 'ja'       , 'バネブー'),
    (       325, 'en'       , 'Spoink'),
    (       326, 'ja'       , 'ブーピッグ'),
    (       326, 'en'       , 'Grumpig'),
    (       327, 'ja'       , 'パッチール'),
    (       327, 'en'       , 'Spinda'),
    (       328, 'ja'       , 'ナックラー'),
    (       328, 'en'       , 'Trapinch'),
    (       329, 'ja'       , 'ビブラーバ'),
    (       329, 'en'       , 'Vibrava'),
    (       330, 'ja'       , 'フライゴン'),
    (       330, 'en'       , 'Flygon'),
    (       331, 'ja'       , 'サボネア'),
    (       331, 'en'       , 'Cacnea'),
    (       332, 'ja'       , 'ノクタス'),
    (       332, 'en'       , 'Cacturne'),
    (       333, 'ja'       , 'チルット'),
    (       333, 'en'       , 'Swablu'),
    (       334, 'ja'       , 'チルタリス'),
    (       334, 'en'       , 'Altaria'),
    (       335, 'ja'       , 'ザングース'),
    (       335, 'en'       , 'Zangoose'),
    (       336, 'ja'       , 'ハブネーク'),
    (       336, 'en'       , 'Seviper'),
    (       337, 'ja'       , 'ルナトーン'),
    (       337, 'en'       , 'Lunatone'),
    (       338, 'ja'       , 'ソルロック'),
    (       338, 'en'       , 'Solrock'),
    (       339, 'ja'       , 'ドジョッチ'),
    (       339, 'en'       , 'Barboach'),
    (       340, 'ja'       , 'ナマズン'),
    (       340, 'en'       , 'Whiscash'),
    (       341, 'ja'       , 'ヘイガニ'),
    (       341, 'en'       , 'Corphish'),
    (       342, 'ja'       , 'シザリガー'),
    (       342, 'en'       , 'Crawdaunt'),
    (       343, 'ja'       , 'ヤジロン'),
    (       343, 'en'       , 'Baltoy'),
    (       344, 'ja'       , 'ネンドール'),
    (       344, 'en'       , 'Claydol'),
    (       345, 'ja'       , 'リリーラ'),
    (       345, 'en'       , 'Lileep'),
    (       346, 'ja'       , 'ユレイドル'),
    (       346, 'en'       , 'Cradily'),
    (       347, 'ja'       , 'アノプス'),
    (       347, 'en'       , 'Anorith'),
    (       348, 'ja'       , 'アーマルド'),
    (       348, 'en'       , 'Armaldo'),
    (       349, 'ja'       , 'ヒンバス'),
    (       349, 'en'       , 'Feebas'),
    (       350, 'ja'       , 'ミロカロス'),
    (       350, 'en'       , 'Milotic'),
    (       351, 'ja'       , 'ポワルン'),
    (       351, 'en'       , 'Castform'),
    (       352, 'ja'       , 'カクレオン'),
    (       352, 'en'       , 'Kecleon'),
    (       353, 'ja'       , 'カゲボウズ'),
    (       353, 'en'       , 'Shuppet'),
    (       354, 'ja'       , 'ジュペッタ'),
    (       354, 'en'       , 'Banette'),
    (       355, 'ja'       , 'ヨマワル'),
    (       355, 'en'       , 'Duskull'),
    (       356, 'ja'       , 'サマヨール'),
    (       356, 'en'       , 'Dusclops'),
    (       357, 'ja'       , 'トロピウス'),
    (       357, 'en'       , 'Tropius'),
    (       358, 'ja'       , 'チリーン'),
    (       358, 'en'       , 'Chimecho'),
    (       359, 'ja'       , 'アブソル'),
    (       359, 'en'       , 'Absol'),
    (       360, 'ja'       , 'ソーナノ'),
    (       360, 'en'       , 'Wynaut'),
    (       361, 'ja'       , 'ユキワラシ'),
    (       361, 'en'       , 'Snorunt'),
    (       362, 'ja'       , 'オニゴーリ'),
    (       362, 'en'       , 'Glalie'),
    (       363, 'ja'       , 'タマザラシ'),
    (       363, 'en'       , 'Spheal'),
    (       364, 'ja'       , 'トドグラー'),
    (       364, 'en'       , 'Sealeo'),
    (       365, 'ja'       , 'トドゼルガ'),
    (       365, 'en'       , 'Walrein'),
    (       366, 'ja'       , 'パールル'),
    (       366, 'en'       , 'Clamperl'),
    (       367, 'ja'       , 'ハンテール'),
    (       367, 'en'       , 'Huntail'),
    (       368, 'ja'       , 'サクラビス'),
    (       368, 'en'       , 'Gorebyss'),
    (       369, 'ja'       , 'ジーランス'),
    (       369, 'en'       , 'Relicanth'),
    (       370, 'ja'       , 'ラブカス'),
    (       370, 'en'       , 'Luvdisc'),
    (       371, 'ja'       , 'タツベイ'),
    (       371, 'en'       , 'Bagon'),
    (       372, 'ja'       , 'コモルー'),
    (       372, 'en'       , 'Shelgon'),
    (       373, 'ja'       , 'ボーマンダ'),
    (       373, 'en'       , 'Salamence'),
    (       374, 'ja'       , 'ダンバル'),
    (       374, 'en'       , 'Beldum'),
    (       375, 'ja'       , 'メタング'),
    (       375, 'en'       , 'Metang'),
    (       376, 'ja'       , 'メタグロス'),
    (       376, 'en'       , 'Metagross'),
    (       377, 'ja'       , 'レジロック'),
    (       377, 'en'       , 'Regirock'),
    (       378, 'ja'       , 'レジアイス'),
    (       378, 'en'       , 'Regice'),
    (       379, 'ja'       , 'レジスチル'),
    (       379, 'en'       , 'Registeel'),
    (       380, 'ja'       , 'ラティアス'),
    (       380, 'en'       , 'Latias'),
    (       381, 'ja'       , 'ラティオス'),
    (       381, 'en'       , 'Latios'),
    (       382, 'ja'       , 'カイオーガ'),
    (       382, 'en'       , 'Kyogre'),
    (       383, 'ja'       , 'グラードン'),
    (       383, 'en'       , 'Groudon'),
    (       384, 'ja'       , 'レックウザ'),
    (       384, 'en'       , 'Rayquaza'),
    (       385, 'ja'       , 'ジラーチ'),
    (       385, 'en'       , 'Jirachi'),
    (       386, 'ja'       , 'デオキシス'),
    (       386, 'en'       , 'Deoxys');

CREATE TABLE forme_names
(
    forme_id INTEGER NOT NULL,
    language_id TEXT NOT NULL,
    `name` TEXT UNIQUE NOT NULL,
    PRIMARY KEY(forme_id, language_id)
);

INSERT INTO forme_names
    (forme_id, language_id, `name`)
VALUES
    (       1, 'ja'       , 'たいようのすがた'),
    (       1, 'en'       , 'Sunny Form'),
    (       2, 'ja'       , 'あまみずのすがた'),
    (       2, 'en'       , 'Rainy Form'),
    (       3, 'ja'       , 'ゆきぐものすがた'),
    (       3, 'en'       , 'Snowy Form'),
    (       4, 'ja'       , 'ノーマルフォルム'),
    (       4, 'en'       , 'Normal Forme'),
    (       5, 'ja'       , 'アタックフォルム'),
    (       5, 'en'       , 'Attack Forme'),
    (       6, 'ja'       , 'ディフェンスフォルム'),
    (       6, 'en'       , 'Defense Forme'),
    (       7, 'ja'       , 'スピードフォルム'),
    (       7, 'en'       , 'Speed Forme');

CREATE TABLE pokemon_formes
(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    pokemon_id INTEGER NOT NULL,
    forme_id INTEGER NOT NULL,
    UNIQUE(pokemon_id, forme_id)
);

INSERT INTO pokemon_formes
(
    pokemon_id, forme_id
)
VALUES
    (         1,       0),
    (         2,       0),
    (         3,       0),
    (         4,       0),
    (         5,       0),
    (         6,       0),
    (         7,       0),
    (         8,       0),
    (         9,       0),
    (        10,       0),
    (        11,       0),
    (        12,       0),
    (        13,       0),
    (        14,       0),
    (        15,       0),
    (        16,       0),
    (        17,       0),
    (        18,       0),
    (        19,       0),
    (        20,       0),
    (        21,       0),
    (        22,       0),
    (        23,       0),
    (        24,       0),
    (        25,       0),
    (        26,       0),
    (        27,       0),
    (        28,       0),
    (        29,       0),
    (        30,       0),
    (        31,       0),
    (        32,       0),
    (        33,       0),
    (        34,       0),
    (        35,       0),
    (        36,       0),
    (        37,       0),
    (        38,       0),
    (        39,       0),
    (        40,       0),
    (        41,       0),
    (        42,       0),
    (        43,       0),
    (        44,       0),
    (        45,       0),
    (        46,       0),
    (        47,       0),
    (        48,       0),
    (        49,       0),
    (        50,       0),
    (        51,       0),
    (        52,       0),
    (        53,       0),
    (        54,       0),
    (        55,       0),
    (        56,       0),
    (        57,       0),
    (        58,       0),
    (        59,       0),
    (        60,       0),
    (        61,       0),
    (        62,       0),
    (        63,       0),
    (        64,       0),
    (        65,       0),
    (        66,       0),
    (        67,       0),
    (        68,       0),
    (        69,       0),
    (        70,       0),
    (        71,       0),
    (        72,       0),
    (        73,       0),
    (        74,       0),
    (        75,       0),
    (        76,       0),
    (        77,       0),
    (        78,       0),
    (        79,       0),
    (        80,       0),
    (        81,       0),
    (        82,       0),
    (        83,       0),
    (        84,       0),
    (        85,       0),
    (        86,       0),
    (        87,       0),
    (        88,       0),
    (        89,       0),
    (        90,       0),
    (        91,       0),
    (        92,       0),
    (        93,       0),
    (        94,       0),
    (        95,       0),
    (        96,       0),
    (        97,       0),
    (        98,       0),
    (        99,       0),
    (       100,       0),
    (       101,       0),
    (       102,       0),
    (       103,       0),
    (       104,       0),
    (       105,       0),
    (       106,       0),
    (       107,       0),
    (       108,       0),
    (       109,       0),
    (       110,       0),
    (       111,       0),
    (       112,       0),
    (       113,       0),
    (       114,       0),
    (       115,       0),
    (       116,       0),
    (       117,       0),
    (       118,       0),
    (       119,       0),
    (       120,       0),
    (       121,       0),
    (       122,       0),
    (       123,       0),
    (       124,       0),
    (       125,       0),
    (       126,       0),
    (       127,       0),
    (       128,       0),
    (       129,       0),
    (       130,       0),
    (       131,       0),
    (       132,       0),
    (       133,       0),
    (       134,       0),
    (       135,       0),
    (       136,       0),
    (       137,       0),
    (       138,       0),
    (       139,       0),
    (       140,       0),
    (       141,       0),
    (       142,       0),
    (       143,       0),
    (       144,       0),
    (       145,       0),
    (       146,       0),
    (       147,       0),
    (       148,       0),
    (       149,       0),
    (       150,       0),
    (       151,       0),
    (       152,       0),
    (       153,       0),
    (       154,       0),
    (       155,       0),
    (       156,       0),
    (       157,       0),
    (       158,       0),
    (       159,       0),
    (       160,       0),
    (       161,       0),
    (       162,       0),
    (       163,       0),
    (       164,       0),
    (       165,       0),
    (       166,       0),
    (       167,       0),
    (       168,       0),
    (       169,       0),
    (       170,       0),
    (       171,       0),
    (       172,       0),
    (       173,       0),
    (       174,       0),
    (       175,       0),
    (       176,       0),
    (       177,       0),
    (       178,       0),
    (       179,       0),
    (       180,       0),
    (       181,       0),
    (       182,       0),
    (       183,       0),
    (       184,       0),
    (       185,       0),
    (       186,       0),
    (       187,       0),
    (       188,       0),
    (       189,       0),
    (       190,       0),
    (       191,       0),
    (       192,       0),
    (       193,       0),
    (       194,       0),
    (       195,       0),
    (       196,       0),
    (       197,       0),
    (       198,       0),
    (       199,       0),
    (       200,       0),
    (       201,       0),
    (       202,       0),
    (       203,       0),
    (       204,       0),
    (       205,       0),
    (       206,       0),
    (       207,       0),
    (       208,       0),
    (       209,       0),
    (       210,       0),
    (       211,       0),
    (       212,       0),
    (       213,       0),
    (       214,       0),
    (       215,       0),
    (       216,       0),
    (       217,       0),
    (       218,       0),
    (       219,       0),
    (       220,       0),
    (       221,       0),
    (       222,       0),
    (       223,       0),
    (       224,       0),
    (       225,       0),
    (       226,       0),
    (       227,       0),
    (       228,       0),
    (       229,       0),
    (       230,       0),
    (       231,       0),
    (       232,       0),
    (       233,       0),
    (       234,       0),
    (       235,       0),
    (       236,       0),
    (       237,       0),
    (       238,       0),
    (       239,       0),
    (       240,       0),
    (       241,       0),
    (       242,       0),
    (       243,       0),
    (       244,       0),
    (       245,       0),
    (       246,       0),
    (       247,       0),
    (       248,       0),
    (       249,       0),
    (       250,       0),
    (       251,       0),
    (       252,       0),
    (       253,       0),
    (       254,       0),
    (       255,       0),
    (       256,       0),
    (       257,       0),
    (       258,       0),
    (       259,       0),
    (       260,       0),
    (       261,       0),
    (       262,       0),
    (       263,       0),
    (       264,       0),
    (       265,       0),
    (       266,       0),
    (       267,       0),
    (       268,       0),
    (       269,       0),
    (       270,       0),
    (       271,       0),
    (       272,       0),
    (       273,       0),
    (       274,       0),
    (       275,       0),
    (       276,       0),
    (       277,       0),
    (       278,       0),
    (       279,       0),
    (       280,       0),
    (       281,       0),
    (       282,       0),
    (       283,       0),
    (       284,       0),
    (       285,       0),
    (       286,       0),
    (       287,       0),
    (       288,       0),
    (       289,       0),
    (       290,       0),
    (       291,       0),
    (       292,       0),
    (       293,       0),
    (       294,       0),
    (       295,       0),
    (       296,       0),
    (       297,       0),
    (       298,       0),
    (       299,       0),
    (       300,       0),
    (       301,       0),
    (       302,       0),
    (       303,       0),
    (       304,       0),
    (       305,       0),
    (       306,       0),
    (       307,       0),
    (       308,       0),
    (       309,       0),
    (       310,       0),
    (       311,       0),
    (       312,       0),
    (       313,       0),
    (       314,       0),
    (       315,       0),
    (       316,       0),
    (       317,       0),
    (       318,       0),
    (       319,       0),
    (       320,       0),
    (       321,       0),
    (       322,       0),
    (       323,       0),
    (       324,       0),
    (       325,       0),
    (       326,       0),
    (       327,       0),
    (       328,       0),
    (       329,       0),
    (       330,       0),
    (       331,       0),
    (       332,       0),
    (       333,       0),
    (       334,       0),
    (       335,       0),
    (       336,       0),
    (       337,       0),
    (       338,       0),
    (       339,       0),
    (       340,       0),
    (       341,       0),
    (       342,       0),
    (       343,       0),
    (       344,       0),
    (       345,       0),
    (       346,       0),
    (       347,       0),
    (       348,       0),
    (       349,       0),
    (       350,       0),
    (       351,       0),
    (       351,       1),
    (       351,       2),
    (       351,       3),
    (       352,       0),
    (       353,       0),
    (       354,       0),
    (       355,       0),
    (       356,       0),
    (       357,       0),
    (       358,       0),
    (       359,       0),
    (       360,       0),
    (       361,       0),
    (       362,       0),
    (       363,       0),
    (       364,       0),
    (       365,       0),
    (       366,       0),
    (       367,       0),
    (       368,       0),
    (       369,       0),
    (       370,       0),
    (       371,       0),
    (       372,       0),
    (       373,       0),
    (       374,       0),
    (       375,       0),
    (       376,       0),
    (       377,       0),
    (       378,       0),
    (       379,       0),
    (       380,       0),
    (       381,       0),
    (       382,       0),
    (       383,       0),
    (       384,       0),
    (       385,       0),
    (       386,       4),
    (       386,       5),
    (       386,       6),
    (       386,       7);

CREATE TABLE pokemon_forme_bases
(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    pokemon_forme_id INTEGER NOT NULL,
    stat_id INTEGER NOT NULL,
    base INTEGER NOT NULL,
    UNIQUE(pokemon_forme_id, stat_id)
);

INSERT INTO pokemon_forme_bases
(
    pokemon_forme_id, stat_id, base
)
VALUES
    -- [  1] フシギダネ
    (  1, 0,  45), (  1, 1,  49), (  1, 2,  49), (  1, 3,  65), (  1, 4,  65), (  1, 5,  45),
    -- [  2] フシギソウ
    (  2, 0,  60), (  2, 1,  62), (  2, 2,  63), (  2, 3,  80), (  2, 4,  80), (  2, 5,  60),
    -- [  3] フシギバナ
    (  3, 0,  80), (  3, 1,  82), (  3, 2,  83), (  3, 3, 100), (  3, 4, 100), (  3, 5,  80),
    -- [  4] ヒトカゲ
    (  4, 0,  39), (  4, 1,  52), (  4, 2,  43), (  4, 3,  60), (  4, 4,  50), (  4, 5,  65),
    -- [  5] リザード
    (  5, 0,  58), (  5, 1,  64), (  5, 2,  58), (  5, 3,  80), (  5, 4,  65), (  5, 5,  80),
    -- [  6] リザードン
    (  6, 0,  78), (  6, 1,  84), (  6, 2,  78), (  6, 3, 109), (  6, 4,  85), (  6, 5, 100),
    -- [  7] ゼニガメ
    (  7, 0,  44), (  7, 1,  48), (  7, 2,  65), (  7, 3,  50), (  7, 4,  64), (  7, 5,  43),
    -- [  8] カメール
    (  8, 0,  59), (  8, 1,  63), (  8, 2,  80), (  8, 3,  65), (  8, 4,  80), (  8, 5,  58),
    -- [  9] カメックス
    (  9, 0,  79), (  9, 1,  83), (  9, 2, 100), (  9, 3,  85), (  9, 4, 105), (  9, 5,  78),
    -- [ 10] キャタピー
    ( 10, 0,  45), ( 10, 1,  30), ( 10, 2,  35), ( 10, 3,  20), ( 10, 4,  20), ( 10, 5,  45),
    -- [ 11] トランセル
    ( 11, 0,  50), ( 11, 1,  20), ( 11, 2,  55), ( 11, 3,  25), ( 11, 4,  25), ( 11, 5,  30),
    -- [ 12] バタフリー
    ( 12, 0,  60), ( 12, 1,  45), ( 12, 2,  50), ( 12, 3,  80), ( 12, 4,  80), ( 12, 5,  70),
    -- [ 13] ビードル
    ( 13, 0,  40), ( 13, 1,  35), ( 13, 2,  30), ( 13, 3,  20), ( 13, 4,  20), ( 13, 5,  50),
    -- [ 14] コクーン
    ( 14, 0,  45), ( 14, 1,  25), ( 14, 2,  50), ( 14, 3,  25), ( 14, 4,  25), ( 14, 5,  35),
    -- [ 15] スピアー
    ( 15, 0,  65), ( 15, 1,  80), ( 15, 2,  40), ( 15, 3,  45), ( 15, 4,  80), ( 15, 5,  75),
    -- [ 16] ポッポ
    ( 16, 0,  40), ( 16, 1,  45), ( 16, 2,  40), ( 16, 3,  35), ( 16, 4,  35), ( 16, 5,  56),
    -- [ 17] ピジョン
    ( 17, 0,  63), ( 17, 1,  60), ( 17, 2,  55), ( 17, 3,  50), ( 17, 4,  50), ( 17, 5,  71),
    -- [ 18] ピジョット
    ( 18, 0,  83), ( 18, 1,  80), ( 18, 2,  75), ( 18, 3,  70), ( 18, 4,  70), ( 18, 5,  91),
    -- [ 19] コラッタ
    ( 19, 0,  30), ( 19, 1,  56), ( 19, 2,  35), ( 19, 3,  25), ( 19, 4,  35), ( 19, 5,  72),
    -- [ 20] ラッタ
    ( 20, 0,  55), ( 20, 1,  81), ( 20, 2,  60), ( 20, 3,  50), ( 20, 4,  70), ( 20, 5,  97),
    -- [ 21] オニスズメ
    ( 21, 0,  40), ( 21, 1,  60), ( 21, 2,  30), ( 21, 3,  31), ( 21, 4,  31), ( 21, 5,  70),
    -- [ 22] オニドリル
    ( 22, 0,  65), ( 22, 1,  90), ( 22, 2,  65), ( 22, 3,  61), ( 22, 4,  61), ( 22, 5, 100),
    -- [ 23] アーボ
    ( 23, 0,  35), ( 23, 1,  60), ( 23, 2,  44), ( 23, 3,  40), ( 23, 4,  54), ( 23, 5,  55),
    -- [ 24] アーボック
    ( 24, 0,  60), ( 24, 1,  85), ( 24, 2,  69), ( 24, 3,  65), ( 24, 4,  79), ( 24, 5,  80),
    -- [ 25] ピカチュウ
    ( 25, 0,  35), ( 25, 1,  55), ( 25, 2,  30), ( 25, 3,  50), ( 25, 4,  40), ( 25, 5,  90),
    -- [ 26] ライチュウ
    ( 26, 0,  60), ( 26, 1,  90), ( 26, 2,  55), ( 26, 3,  90), ( 26, 4,  80), ( 26, 5, 100),
    -- [ 27] サンド
    ( 27, 0,  50), ( 27, 1,  75), ( 27, 2,  85), ( 27, 3,  20), ( 27, 4,  30), ( 27, 5,  40),
    -- [ 28] サンドパン
    ( 28, 0,  75), ( 28, 1, 100), ( 28, 2, 110), ( 28, 3,  45), ( 28, 4,  55), ( 28, 5,  65),
    -- [ 29] ニドラン♀
    ( 29, 0,  55), ( 29, 1,  47), ( 29, 2,  52), ( 29, 3,  40), ( 29, 4,  40), ( 29, 5,  41),
    -- [ 30] ニドリーナ
    ( 30, 0,  70), ( 30, 1,  62), ( 30, 2,  67), ( 30, 3,  55), ( 30, 4,  55), ( 30, 5,  56),
    -- [ 31] ニドクイン
    ( 31, 0,  90), ( 31, 1,  82), ( 31, 2,  87), ( 31, 3,  75), ( 31, 4,  85), ( 31, 5,  76),
    -- [ 32] ニドラン♂
    ( 32, 0,  46), ( 32, 1,  57), ( 32, 2,  40), ( 32, 3,  40), ( 32, 4,  40), ( 32, 5,  50),
    -- [ 33] ニドリーノ
    ( 33, 0,  61), ( 33, 1,  72), ( 33, 2,  57), ( 33, 3,  55), ( 33, 4,  55), ( 33, 5,  65),
    -- [ 34] ニドキング
    ( 34, 0,  81), ( 34, 1,  92), ( 34, 2,  77), ( 34, 3,  85), ( 34, 4,  75), ( 34, 5,  85),
    -- [ 35] ピッピ
    ( 35, 0,  70), ( 35, 1,  45), ( 35, 2,  48), ( 35, 3,  60), ( 35, 4,  65), ( 35, 5,  35),
    -- [ 36] ピクシー
    ( 36, 0,  95), ( 36, 1,  70), ( 36, 2,  73), ( 36, 3,  85), ( 36, 4,  90), ( 36, 5,  60),
    -- [ 37] ロコン
    ( 37, 0,  38), ( 37, 1,  41), ( 37, 2,  40), ( 37, 3,  50), ( 37, 4,  65), ( 37, 5,  65),
    -- [ 38] キュウコン
    ( 38, 0,  73), ( 38, 1,  76), ( 38, 2,  75), ( 38, 3,  81), ( 38, 4, 100), ( 38, 5, 100),
    -- [ 39] プリン
    ( 39, 0, 115), ( 39, 1,  45), ( 39, 2,  20), ( 39, 3,  45), ( 39, 4,  25), ( 39, 5,  20),
    -- [ 40] プクリン
    ( 40, 0, 140), ( 40, 1,  70), ( 40, 2,  45), ( 40, 3,  75), ( 40, 4,  50), ( 40, 5,  45),
    -- [ 41] ズバット
    ( 41, 0,  40), ( 41, 1,  45), ( 41, 2,  35), ( 41, 3,  30), ( 41, 4,  40), ( 41, 5,  55),
    -- [ 42] ゴルバット
    ( 42, 0,  75), ( 42, 1,  80), ( 42, 2,  70), ( 42, 3,  65), ( 42, 4,  75), ( 42, 5,  90),
    -- [ 43] ナゾノクサ
    ( 43, 0,  45), ( 43, 1,  50), ( 43, 2,  55), ( 43, 3,  75), ( 43, 4,  65), ( 43, 5,  30),
    -- [ 44] クサイハナ
    ( 44, 0,  60), ( 44, 1,  65), ( 44, 2,  70), ( 44, 3,  85), ( 44, 4,  75), ( 44, 5,  40),
    -- [ 45] ラフレシア
    ( 45, 0,  75), ( 45, 1,  80), ( 45, 2,  85), ( 45, 3, 100), ( 45, 4,  90), ( 45, 5,  50),
    -- [ 46] パラス
    ( 46, 0,  35), ( 46, 1,  70), ( 46, 2,  55), ( 46, 3,  45), ( 46, 4,  55), ( 46, 5,  25),
    -- [ 47] パラセクト
    ( 47, 0,  60), ( 47, 1,  95), ( 47, 2,  80), ( 47, 3,  60), ( 47, 4,  80), ( 47, 5,  30),
    -- [ 48] コンパン
    ( 48, 0,  60), ( 48, 1,  55), ( 48, 2,  50), ( 48, 3,  40), ( 48, 4,  55), ( 48, 5,  45),
    -- [ 49] モルフォン
    ( 49, 0,  70), ( 49, 1,  65), ( 49, 2,  60), ( 49, 3,  90), ( 49, 4,  75), ( 49, 5,  90),
    -- [ 50] ディグダ
    ( 50, 0,  10), ( 50, 1,  55), ( 50, 2,  25), ( 50, 3,  35), ( 50, 4,  45), ( 50, 5,  95),
    -- [ 51] ダグトリオ
    ( 51, 0,  35), ( 51, 1,  80), ( 51, 2,  50), ( 51, 3,  50), ( 51, 4,  70), ( 51, 5, 120),
    -- [ 52] ニャース
    ( 52, 0,  40), ( 52, 1,  45), ( 52, 2,  35), ( 52, 3,  40), ( 52, 4,  40), ( 52, 5,  90),
    -- [ 53] ペルシアン
    ( 53, 0,  65), ( 53, 1,  70), ( 53, 2,  60), ( 53, 3,  65), ( 53, 4,  65), ( 53, 5, 115),
    -- [ 54] コダック
    ( 54, 0,  50), ( 54, 1,  52), ( 54, 2,  48), ( 54, 3,  65), ( 54, 4,  50), ( 54, 5,  55),
    -- [ 55] ゴルダック
    ( 55, 0,  80), ( 55, 1,  82), ( 55, 2,  78), ( 55, 3,  95), ( 55, 4,  80), ( 55, 5,  85),
    -- [ 56] マンキー
    ( 56, 0,  40), ( 56, 1,  80), ( 56, 2,  35), ( 56, 3,  35), ( 56, 4,  45), ( 56, 5,  70),
    -- [ 57] オコリザル
    ( 57, 0,  65), ( 57, 1, 105), ( 57, 2,  60), ( 57, 3,  60), ( 57, 4,  70), ( 57, 5,  95),
    -- [ 58] ガーディ
    ( 58, 0,  55), ( 58, 1,  70), ( 58, 2,  45), ( 58, 3,  70), ( 58, 4,  50), ( 58, 5,  60),
    -- [ 59] ウインディ
    ( 59, 0,  90), ( 59, 1, 110), ( 59, 2,  80), ( 59, 3, 100), ( 59, 4,  80), ( 59, 5,  95),
    -- [ 60] ニョロモ
    ( 60, 0,  40), ( 60, 1,  50), ( 60, 2,  40), ( 60, 3,  40), ( 60, 4,  40), ( 60, 5,  90),
    -- [ 61] ニョロゾ
    ( 61, 0,  65), ( 61, 1,  65), ( 61, 2,  65), ( 61, 3,  50), ( 61, 4,  50), ( 61, 5,  90),
    -- [ 62] ニョロボン
    ( 62, 0,  90), ( 62, 1,  85), ( 62, 2,  95), ( 62, 3,  70), ( 62, 4,  90), ( 62, 5,  70),
    -- [ 63] ケーシィ
    ( 63, 0,  25), ( 63, 1,  20), ( 63, 2,  15), ( 63, 3, 105), ( 63, 4,  55), ( 63, 5,  90),
    -- [ 64] ユンゲラー
    ( 64, 0,  40), ( 64, 1,  35), ( 64, 2,  30), ( 64, 3, 120), ( 64, 4,  70), ( 64, 5, 105),
    -- [ 65] フーディン
    ( 65, 0,  55), ( 65, 1,  50), ( 65, 2,  45), ( 65, 3, 135), ( 65, 4,  85), ( 65, 5, 120),
    -- [ 66] ワンリキー
    ( 66, 0,  70), ( 66, 1,  80), ( 66, 2,  50), ( 66, 3,  35), ( 66, 4,  35), ( 66, 5,  35),
    -- [ 67] ゴーリキー
    ( 67, 0,  80), ( 67, 1, 100), ( 67, 2,  70), ( 67, 3,  50), ( 67, 4,  60), ( 67, 5,  45),
    -- [ 68] カイリキー
    ( 68, 0,  90), ( 68, 1, 130), ( 68, 2,  80), ( 68, 3,  65), ( 68, 4,  85), ( 68, 5,  55),
    -- [ 69] マダツボミ
    ( 69, 0,  50), ( 69, 1,  75), ( 69, 2,  35), ( 69, 3,  70), ( 69, 4,  30), ( 69, 5,  40),
    -- [ 70] ウツドン
    ( 70, 0,  65), ( 70, 1,  90), ( 70, 2,  50), ( 70, 3,  85), ( 70, 4,  45), ( 70, 5,  55),
    -- [ 71] ウツボット
    ( 71, 0,  80), ( 71, 1, 105), ( 71, 2,  65), ( 71, 3, 100), ( 71, 4,  60), ( 71, 5,  70),
    -- [ 72] メノクラゲ
    ( 72, 0,  40), ( 72, 1,  40), ( 72, 2,  35), ( 72, 3,  50), ( 72, 4, 100), ( 72, 5,  70),
    -- [ 73] ドククラゲ
    ( 73, 0,  80), ( 73, 1,  70), ( 73, 2,  65), ( 73, 3,  80), ( 73, 4, 120), ( 73, 5, 100),
    -- [ 74] イシツブテ
    ( 74, 0,  40), ( 74, 1,  80), ( 74, 2, 100), ( 74, 3,  30), ( 74, 4,  30), ( 74, 5,  20),
    -- [ 75] ゴローン
    ( 75, 0,  55), ( 75, 1,  95), ( 75, 2, 115), ( 75, 3,  45), ( 75, 4,  45), ( 75, 5,  35),
    -- [ 76] ゴローニャ
    ( 76, 0,  80), ( 76, 1, 110), ( 76, 2, 130), ( 76, 3,  55), ( 76, 4,  65), ( 76, 5,  45),
    -- [ 77] ポニータ
    ( 77, 0,  50), ( 77, 1,  85), ( 77, 2,  55), ( 77, 3,  65), ( 77, 4,  65), ( 77, 5,  90),
    -- [ 78] ギャロップ
    ( 78, 0,  65), ( 78, 1, 100), ( 78, 2,  70), ( 78, 3,  80), ( 78, 4,  80), ( 78, 5, 105),
    -- [ 79] ヤドン
    ( 79, 0,  90), ( 79, 1,  65), ( 79, 2,  65), ( 79, 3,  40), ( 79, 4,  40), ( 79, 5,  15),
    -- [ 80] ヤドラン
    ( 80, 0,  95), ( 80, 1,  75), ( 80, 2, 110), ( 80, 3, 100), ( 80, 4,  80), ( 80, 5,  30),
    -- [ 81] コイル
    ( 81, 0,  25), ( 81, 1,  35), ( 81, 2,  70), ( 81, 3,  95), ( 81, 4,  55), ( 81, 5,  45),
    -- [ 82] レアコイル
    ( 82, 0,  50), ( 82, 1,  60), ( 82, 2,  95), ( 82, 3, 120), ( 82, 4,  70), ( 82, 5,  70),
    -- [ 83] カモネギ
    ( 83, 0,  52), ( 83, 1,  65), ( 83, 2,  55), ( 83, 3,  58), ( 83, 4,  62), ( 83, 5,  60),
    -- [ 84] ドードー
    ( 84, 0,  35), ( 84, 1,  85), ( 84, 2,  45), ( 84, 3,  35), ( 84, 4,  35), ( 84, 5,  75),
    -- [ 85] ドードリオ
    ( 85, 0,  60), ( 85, 1, 110), ( 85, 2,  70), ( 85, 3,  60), ( 85, 4,  60), ( 85, 5, 100),
    -- [ 86] パウワウ
    ( 86, 0,  65), ( 86, 1,  45), ( 86, 2,  55), ( 86, 3,  45), ( 86, 4,  70), ( 86, 5,  45),
    -- [ 87] ジュゴン
    ( 87, 0,  90), ( 87, 1,  70), ( 87, 2,  80), ( 87, 3,  70), ( 87, 4,  95), ( 87, 5,  70),
    -- [ 88] ベトベター
    ( 88, 0,  80), ( 88, 1,  80), ( 88, 2,  50), ( 88, 3,  40), ( 88, 4,  50), ( 88, 5,  25),
    -- [ 89] ベトベトン
    ( 89, 0, 105), ( 89, 1, 105), ( 89, 2,  75), ( 89, 3,  65), ( 89, 4, 100), ( 89, 5,  50),
    -- [ 90] シェルダー
    ( 90, 0,  30), ( 90, 1,  65), ( 90, 2, 100), ( 90, 3,  45), ( 90, 4,  25), ( 90, 5,  40),
    -- [ 91] パルシェン
    ( 91, 0,  50), ( 91, 1,  95), ( 91, 2, 180), ( 91, 3,  85), ( 91, 4,  45), ( 91, 5,  70),
    -- [ 92] ゴース
    ( 92, 0,  30), ( 92, 1,  35), ( 92, 2,  30), ( 92, 3, 100), ( 92, 4,  35), ( 92, 5,  80),
    -- [ 93] ゴースト
    ( 93, 0,  45), ( 93, 1,  50), ( 93, 2,  45), ( 93, 3, 115), ( 93, 4,  55), ( 93, 5,  95),
    -- [ 94] ゲンガー
    ( 94, 0,  60), ( 94, 1,  65), ( 94, 2,  60), ( 94, 3, 130), ( 94, 4,  75), ( 94, 5, 110),
    -- [ 95] イワーク
    ( 95, 0,  35), ( 95, 1,  45), ( 95, 2, 160), ( 95, 3,  30), ( 95, 4,  45), ( 95, 5,  70),
    -- [ 96] スリープ
    ( 96, 0,  60), ( 96, 1,  48), ( 96, 2,  45), ( 96, 3,  43), ( 96, 4,  90), ( 96, 5,  42),
    -- [ 97] スリーパー
    ( 97, 0,  85), ( 97, 1,  73), ( 97, 2,  70), ( 97, 3,  73), ( 97, 4, 115), ( 97, 5,  67),
    -- [ 98] クラブ
    ( 98, 0,  30), ( 98, 1, 105), ( 98, 2,  90), ( 98, 3,  25), ( 98, 4,  25), ( 98, 5,  50),
    -- [ 99] キングラー
    ( 99, 0,  55), ( 99, 1, 130), ( 99, 2, 115), ( 99, 3,  50), ( 99, 4,  50), ( 99, 5,  75),
    -- [100] ビリリダマ
    (100, 0,  40), (100, 1,  30), (100, 2,  50), (100, 3,  55), (100, 4,  55), (100, 5, 100),
    -- [101] マルマイン
    (101, 0,  60), (101, 1,  50), (101, 2,  70), (101, 3,  80), (101, 4,  80), (101, 5, 140),
    -- [102] タマタマ
    (102, 0,  60), (102, 1,  40), (102, 2,  80), (102, 3,  60), (102, 4,  45), (102, 5,  40),
    -- [103] ナッシー
    (103, 0,  95), (103, 1,  95), (103, 2,  85), (103, 3, 125), (103, 4,  65), (103, 5,  55),
    -- [104] カラカラ
    (104, 0,  50), (104, 1,  50), (104, 2,  95), (104, 3,  40), (104, 4,  50), (104, 5,  35),
    -- [105] ガラガラ
    (105, 0,  60), (105, 1,  80), (105, 2, 110), (105, 3,  50), (105, 4,  80), (105, 5,  45),
    -- [106] サワムラー
    (106, 0,  50), (106, 1, 120), (106, 2,  53), (106, 3,  35), (106, 4, 110), (106, 5,  87),
    -- [107] エビワラー
    (107, 0,  50), (107, 1, 105), (107, 2,  79), (107, 3,  35), (107, 4, 110), (107, 5,  76),
    -- [108] ベロリンガ
    (108, 0,  90), (108, 1,  55), (108, 2,  75), (108, 3,  60), (108, 4,  75), (108, 5,  30),
    -- [109] ドガース
    (109, 0,  40), (109, 1,  65), (109, 2,  95), (109, 3,  60), (109, 4,  45), (109, 5,  35),
    -- [110] マタドガス
    (110, 0,  65), (110, 1,  90), (110, 2, 120), (110, 3,  85), (110, 4,  70), (110, 5,  60),
    -- [111] サイホーン
    (111, 0,  80), (111, 1,  85), (111, 2,  95), (111, 3,  30), (111, 4,  30), (111, 5,  25),
    -- [112] サイドン
    (112, 0, 105), (112, 1, 130), (112, 2, 120), (112, 3,  45), (112, 4,  45), (112, 5,  40),
    -- [113] ラッキー
    (113, 0, 250), (113, 1,   5), (113, 2,   5), (113, 3,  35), (113, 4, 105), (113, 5,  50),
    -- [114] モンジャラ
    (114, 0,  65), (114, 1,  55), (114, 2, 115), (114, 3, 100), (114, 4,  40), (114, 5,  60),
    -- [115] ガルーラ
    (115, 0, 105), (115, 1,  95), (115, 2,  80), (115, 3,  40), (115, 4,  80), (115, 5,  90),
    -- [116] タッツー
    (116, 0,  30), (116, 1,  40), (116, 2,  70), (116, 3,  70), (116, 4,  25), (116, 5,  60),
    -- [117] シードラ
    (117, 0,  55), (117, 1,  65), (117, 2,  95), (117, 3,  95), (117, 4,  45), (117, 5,  85),
    -- [118] トサキント
    (118, 0,  45), (118, 1,  67), (118, 2,  60), (118, 3,  35), (118, 4,  50), (118, 5,  63),
    -- [119] アズマオウ
    (119, 0,  80), (119, 1,  92), (119, 2,  65), (119, 3,  65), (119, 4,  80), (119, 5,  68),
    -- [120] ヒトデマン
    (120, 0,  30), (120, 1,  45), (120, 2,  55), (120, 3,  70), (120, 4,  55), (120, 5,  85),
    -- [121] スターミー
    (121, 0,  60), (121, 1,  75), (121, 2,  85), (121, 3, 100), (121, 4,  85), (121, 5, 115),
    -- [122] バリヤード
    (122, 0,  40), (122, 1,  45), (122, 2,  65), (122, 3, 100), (122, 4, 120), (122, 5,  90),
    -- [123] ストライク
    (123, 0,  70), (123, 1, 110), (123, 2,  80), (123, 3,  55), (123, 4,  80), (123, 5, 105),
    -- [124] ルージュラ
    (124, 0,  65), (124, 1,  50), (124, 2,  35), (124, 3, 115), (124, 4,  95), (124, 5,  95),
    -- [125] エレブー
    (125, 0,  65), (125, 1,  83), (125, 2,  57), (125, 3,  95), (125, 4,  85), (125, 5, 105),
    -- [126] ブーバー
    (126, 0,  65), (126, 1,  95), (126, 2,  57), (126, 3, 100), (126, 4,  85), (126, 5,  93),
    -- [127] カイロス
    (127, 0,  65), (127, 1, 125), (127, 2, 100), (127, 3,  55), (127, 4,  70), (127, 5,  85),
    -- [128] ケンタロス
    (128, 0,  75), (128, 1, 100), (128, 2,  95), (128, 3,  40), (128, 4,  70), (128, 5, 110),
    -- [129] コイキング
    (129, 0,  20), (129, 1,  10), (129, 2,  55), (129, 3,  15), (129, 4,  20), (129, 5,  80),
    -- [130] ギャラドス
    (130, 0,  95), (130, 1, 125), (130, 2,  79), (130, 3,  60), (130, 4, 100), (130, 5,  81),
    -- [131] ラプラス
    (131, 0, 130), (131, 1,  85), (131, 2,  80), (131, 3,  85), (131, 4,  95), (131, 5,  60),
    -- [132] メタモン
    (132, 0,  48), (132, 1,  48), (132, 2,  48), (132, 3,  48), (132, 4,  48), (132, 5,  48),
    -- [133] イーブイ
    (133, 0,  55), (133, 1,  55), (133, 2,  50), (133, 3,  45), (133, 4,  65), (133, 5,  55),
    -- [134] シャワーズ
    (134, 0, 130), (134, 1,  65), (134, 2,  60), (134, 3, 110), (134, 4,  95), (134, 5,  65),
    -- [135] サンダース
    (135, 0,  65), (135, 1,  65), (135, 2,  60), (135, 3, 110), (135, 4,  95), (135, 5, 130),
    -- [136] ブースター
    (136, 0,  65), (136, 1, 130), (136, 2,  60), (136, 3,  95), (136, 4, 110), (136, 5,  65),
    -- [137] ポリゴン
    (137, 0,  65), (137, 1,  60), (137, 2,  70), (137, 3,  85), (137, 4,  75), (137, 5,  40),
    -- [138] オムナイト
    (138, 0,  35), (138, 1,  40), (138, 2, 100), (138, 3,  90), (138, 4,  55), (138, 5,  35),
    -- [139] オムスター
    (139, 0,  70), (139, 1,  60), (139, 2, 125), (139, 3, 115), (139, 4,  70), (139, 5,  55),
    -- [140] カブト
    (140, 0,  30), (140, 1,  80), (140, 2,  90), (140, 3,  55), (140, 4,  45), (140, 5,  55),
    -- [141] カブトプス
    (141, 0,  60), (141, 1, 115), (141, 2, 105), (141, 3,  65), (141, 4,  70), (141, 5,  80),
    -- [142] プテラ
    (142, 0,  80), (142, 1, 105), (142, 2,  65), (142, 3,  60), (142, 4,  75), (142, 5, 130),
    -- [143] カビゴン
    (143, 0, 160), (143, 1, 110), (143, 2,  65), (143, 3,  65), (143, 4, 110), (143, 5,  30),
    -- [144] フリーザー
    (144, 0,  90), (144, 1,  85), (144, 2, 100), (144, 3,  95), (144, 4, 125), (144, 5,  85),
    -- [145] サンダー
    (145, 0,  90), (145, 1,  90), (145, 2,  85), (145, 3, 125), (145, 4,  90), (145, 5, 100),
    -- [146] ファイヤー
    (146, 0,  90), (146, 1, 100), (146, 2,  90), (146, 3, 125), (146, 4,  85), (146, 5,  90),
    -- [147] ミニリュウ
    (147, 0,  41), (147, 1,  64), (147, 2,  45), (147, 3,  50), (147, 4,  50), (147, 5,  50),
    -- [148] ハクリュー
    (148, 0,  61), (148, 1,  84), (148, 2,  65), (148, 3,  70), (148, 4,  70), (148, 5,  70),
    -- [149] カイリュー
    (149, 0,  91), (149, 1, 134), (149, 2,  95), (149, 3, 100), (149, 4, 100), (149, 5,  80),
    -- [150] ミュウツー
    (150, 0, 106), (150, 1, 110), (150, 2,  90), (150, 3, 154), (150, 4,  90), (150, 5, 130),
    -- [151] ミュウ
    (151, 0, 100), (151, 1, 100), (151, 2, 100), (151, 3, 100), (151, 4, 100), (151, 5, 100),
    -- [152] チコリータ
    (152, 0,  45), (152, 1,  49), (152, 2,  65), (152, 3,  49), (152, 4,  65), (152, 5,  45),
    -- [153] ベイリーフ
    (153, 0,  60), (153, 1,  62), (153, 2,  80), (153, 3,  63), (153, 4,  80), (153, 5,  60),
    -- [154] メガニウム
    (154, 0,  80), (154, 1,  82), (154, 2, 100), (154, 3,  83), (154, 4, 100), (154, 5,  80),
    -- [155] ヒノアラシ
    (155, 0,  39), (155, 1,  52), (155, 2,  43), (155, 3,  60), (155, 4,  50), (155, 5,  65),
    -- [156] マグマラシ
    (156, 0,  58), (156, 1,  64), (156, 2,  58), (156, 3,  80), (156, 4,  65), (156, 5,  80),
    -- [157] バクフーン
    (157, 0,  78), (157, 1,  84), (157, 2,  78), (157, 3, 109), (157, 4,  85), (157, 5, 100),
    -- [158] ワニノコ
    (158, 0,  50), (158, 1,  65), (158, 2,  64), (158, 3,  44), (158, 4,  48), (158, 5,  43),
    -- [159] アリゲイツ
    (159, 0,  65), (159, 1,  80), (159, 2,  80), (159, 3,  59), (159, 4,  63), (159, 5,  58),
    -- [160] オーダイル
    (160, 0,  85), (160, 1, 105), (160, 2, 100), (160, 3,  79), (160, 4,  83), (160, 5,  78),
    -- [161] オタチ
    (161, 0,  35), (161, 1,  46), (161, 2,  34), (161, 3,  35), (161, 4,  45), (161, 5,  20),
    -- [162] オオタチ
    (162, 0,  85), (162, 1,  76), (162, 2,  64), (162, 3,  45), (162, 4,  55), (162, 5,  90),
    -- [163] ホーホー
    (163, 0,  60), (163, 1,  30), (163, 2,  30), (163, 3,  36), (163, 4,  56), (163, 5,  50),
    -- [164] ヨルノズク
    (164, 0, 100), (164, 1,  50), (164, 2,  50), (164, 3,  76), (164, 4,  96), (164, 5,  70),
    -- [165] レディバ
    (165, 0,  40), (165, 1,  20), (165, 2,  30), (165, 3,  40), (165, 4,  80), (165, 5,  55),
    -- [166] レディアン
    (166, 0,  55), (166, 1,  35), (166, 2,  50), (166, 3,  55), (166, 4, 110), (166, 5,  85),
    -- [167] イトマル
    (167, 0,  40), (167, 1,  60), (167, 2,  40), (167, 3,  40), (167, 4,  40), (167, 5,  30),
    -- [168] アリアドス
    (168, 0,  70), (168, 1,  90), (168, 2,  70), (168, 3,  60), (168, 4,  60), (168, 5,  40),
    -- [169] クロバット
    (169, 0,  85), (169, 1,  90), (169, 2,  80), (169, 3,  70), (169, 4,  80), (169, 5, 130),
    -- [170] チョンチー
    (170, 0,  75), (170, 1,  38), (170, 2,  38), (170, 3,  56), (170, 4,  56), (170, 5,  67),
    -- [171] ランターン
    (171, 0, 125), (171, 1,  58), (171, 2,  58), (171, 3,  76), (171, 4,  76), (171, 5,  67),
    -- [172] ピチュー
    (172, 0,  20), (172, 1,  40), (172, 2,  15), (172, 3,  35), (172, 4,  35), (172, 5,  60),
    -- [173] ピィ
    (173, 0,  50), (173, 1,  25), (173, 2,  28), (173, 3,  45), (173, 4,  55), (173, 5,  15),
    -- [174] ププリン
    (174, 0,  90), (174, 1,  30), (174, 2,  15), (174, 3,  40), (174, 4,  20), (174, 5,  15),
    -- [175] トゲピー
    (175, 0,  35), (175, 1,  20), (175, 2,  65), (175, 3,  40), (175, 4,  65), (175, 5,  20),
    -- [176] トゲチック
    (176, 0,  55), (176, 1,  40), (176, 2,  85), (176, 3,  80), (176, 4, 105), (176, 5,  40),
    -- [177] ネイティ
    (177, 0,  40), (177, 1,  50), (177, 2,  45), (177, 3,  70), (177, 4,  45), (177, 5,  70),
    -- [178] ネイティオ
    (178, 0,  65), (178, 1,  75), (178, 2,  70), (178, 3,  95), (178, 4,  70), (178, 5,  95),
    -- [179] メリープ
    (179, 0,  55), (179, 1,  40), (179, 2,  40), (179, 3,  65), (179, 4,  45), (179, 5,  35),
    -- [180] モココ
    (180, 0,  70), (180, 1,  55), (180, 2,  55), (180, 3,  80), (180, 4,  60), (180, 5,  45),
    -- [181] デンリュウ
    (181, 0,  90), (181, 1,  75), (181, 2,  75), (181, 3, 115), (181, 4,  90), (181, 5,  55),
    -- [182] キレイハナ
    (182, 0,  75), (182, 1,  80), (182, 2,  85), (182, 3,  90), (182, 4, 100), (182, 5,  50),
    -- [183] マリル
    (183, 0,  70), (183, 1,  20), (183, 2,  50), (183, 3,  20), (183, 4,  50), (183, 5,  40),
    -- [184] マリルリ
    (184, 0, 100), (184, 1,  50), (184, 2,  80), (184, 3,  50), (184, 4,  80), (184, 5,  50),
    -- [185] ウソッキー
    (185, 0,  70), (185, 1, 100), (185, 2, 115), (185, 3,  30), (185, 4,  65), (185, 5,  30),
    -- [186] ニョロトノ
    (186, 0,  90), (186, 1,  75), (186, 2,  75), (186, 3,  90), (186, 4, 100), (186, 5,  70),
    -- [187] ハネッコ
    (187, 0,  35), (187, 1,  35), (187, 2,  40), (187, 3,  35), (187, 4,  55), (187, 5,  50),
    -- [188] ポポッコ
    (188, 0,  55), (188, 1,  45), (188, 2,  50), (188, 3,  45), (188, 4,  65), (188, 5,  80),
    -- [189] ワタッコ
    (189, 0,  75), (189, 1,  55), (189, 2,  70), (189, 3,  55), (189, 4,  85), (189, 5, 110),
    -- [190] エイパム
    (190, 0,  55), (190, 1,  70), (190, 2,  55), (190, 3,  40), (190, 4,  55), (190, 5,  85),
    -- [191] ヒマナッツ
    (191, 0,  30), (191, 1,  30), (191, 2,  30), (191, 3,  30), (191, 4,  30), (191, 5,  30),
    -- [192] キマワリ
    (192, 0,  75), (192, 1,  75), (192, 2,  55), (192, 3, 105), (192, 4,  85), (192, 5,  30),
    -- [193] ヤンヤンマ
    (193, 0,  65), (193, 1,  65), (193, 2,  45), (193, 3,  75), (193, 4,  45), (193, 5,  95),
    -- [194] ウパー
    (194, 0,  55), (194, 1,  45), (194, 2,  45), (194, 3,  25), (194, 4,  25), (194, 5,  15),
    -- [195] ヌオー
    (195, 0,  95), (195, 1,  85), (195, 2,  85), (195, 3,  65), (195, 4,  65), (195, 5,  35),
    -- [196] エーフィ
    (196, 0,  65), (196, 1,  65), (196, 2,  60), (196, 3, 130), (196, 4,  95), (196, 5, 110),
    -- [197] ブラッキー
    (197, 0,  95), (197, 1,  65), (197, 2, 110), (197, 3,  60), (197, 4, 130), (197, 5,  65),
    -- [198] ヤミカラス
    (198, 0,  60), (198, 1,  85), (198, 2,  42), (198, 3,  85), (198, 4,  42), (198, 5,  91),
    -- [199] ヤドキング
    (199, 0,  95), (199, 1,  75), (199, 2,  80), (199, 3, 100), (199, 4, 110), (199, 5,  30),
    -- [200] ムウマ
    (200, 0,  60), (200, 1,  60), (200, 2,  60), (200, 3,  85), (200, 4,  85), (200, 5,  85),
    -- [201] アンノーン
    (201, 0,  48), (201, 1,  72), (201, 2,  48), (201, 3,  72), (201, 4,  48), (201, 5,  48),
    -- [202] ソーナンス
    (202, 0, 190), (202, 1,  33), (202, 2,  58), (202, 3,  33), (202, 4,  58), (202, 5,  33),
    -- [203] キリンリキ
    (203, 0,  70), (203, 1,  80), (203, 2,  65), (203, 3,  90), (203, 4,  65), (203, 5,  85),
    -- [204] クヌギダマ
    (204, 0,  50), (204, 1,  65), (204, 2,  90), (204, 3,  35), (204, 4,  35), (204, 5,  15),
    -- [205] フォレトス
    (205, 0,  75), (205, 1,  90), (205, 2, 140), (205, 3,  60), (205, 4,  60), (205, 5,  40),
    -- [206] ノコッチ
    (206, 0, 100), (206, 1,  70), (206, 2,  70), (206, 3,  65), (206, 4,  65), (206, 5,  45),
    -- [207] グライガー
    (207, 0,  65), (207, 1,  75), (207, 2, 105), (207, 3,  35), (207, 4,  65), (207, 5,  85),
    -- [208] ハガネール
    (208, 0,  75), (208, 1,  85), (208, 2, 200), (208, 3,  55), (208, 4,  65), (208, 5,  30),
    -- [209] ブルー
    (209, 0,  60), (209, 1,  80), (209, 2,  50), (209, 3,  40), (209, 4,  40), (209, 5,  30),
    -- [210] グランブル
    (210, 0,  90), (210, 1, 120), (210, 2,  75), (210, 3,  60), (210, 4,  60), (210, 5,  45),
    -- [211] ハリーセン
    (211, 0,  65), (211, 1,  95), (211, 2,  75), (211, 3,  55), (211, 4,  55), (211, 5,  85),
    -- [212] ハッサム
    (212, 0,  70), (212, 1, 130), (212, 2, 100), (212, 3,  55), (212, 4,  80), (212, 5,  65),
    -- [213] ツボツボ
    (213, 0,  20), (213, 1,  10), (213, 2, 230), (213, 3,  10), (213, 4, 230), (213, 5,   5),
    -- [214] ヘラクロス
    (214, 0,  80), (214, 1, 125), (214, 2,  75), (214, 3,  40), (214, 4,  95), (214, 5,  85),
    -- [215] ニューラ
    (215, 0,  55), (215, 1,  95), (215, 2,  55), (215, 3,  35), (215, 4,  75), (215, 5, 115),
    -- [216] ヒメグマ
    (216, 0,  60), (216, 1,  80), (216, 2,  50), (216, 3,  50), (216, 4,  50), (216, 5,  40),
    -- [217] リングマ
    (217, 0,  90), (217, 1, 130), (217, 2,  75), (217, 3,  75), (217, 4,  75), (217, 5,  55),
    -- [218] マグマッグ
    (218, 0,  40), (218, 1,  40), (218, 2,  40), (218, 3,  70), (218, 4,  40), (218, 5,  20),
    -- [219] マグカルゴ
    (219, 0,  50), (219, 1,  50), (219, 2, 120), (219, 3,  80), (219, 4,  80), (219, 5,  30),
    -- [220] ウリムー
    (220, 0,  50), (220, 1,  50), (220, 2,  40), (220, 3,  30), (220, 4,  30), (220, 5,  50),
    -- [221] イノムー
    (221, 0, 100), (221, 1, 100), (221, 2,  80), (221, 3,  60), (221, 4,  60), (221, 5,  50),
    -- [222] サニーゴ
    (222, 0,  55), (222, 1,  55), (222, 2,  85), (222, 3,  65), (222, 4,  85), (222, 5,  35),
    -- [223] テッポウオ
    (223, 0,  35), (223, 1,  65), (223, 2,  35), (223, 3,  65), (223, 4,  35), (223, 5,  65),
    -- [224] オクタン
    (224, 0,  75), (224, 1, 105), (224, 2,  75), (224, 3, 105), (224, 4,  75), (224, 5,  45),
    -- [225] デリバード
    (225, 0,  45), (225, 1,  55), (225, 2,  45), (225, 3,  65), (225, 4,  45), (225, 5,  75),
    -- [226] マンタイン
    (226, 0,  65), (226, 1,  40), (226, 2,  70), (226, 3,  80), (226, 4, 140), (226, 5,  70),
    -- [227] エアームド
    (227, 0,  65), (227, 1,  80), (227, 2, 140), (227, 3,  40), (227, 4,  70), (227, 5,  70),
    -- [228] デルビル
    (228, 0,  45), (228, 1,  60), (228, 2,  30), (228, 3,  80), (228, 4,  50), (228, 5,  65),
    -- [229] ヘルガー
    (229, 0,  75), (229, 1,  90), (229, 2,  50), (229, 3, 110), (229, 4,  80), (229, 5,  95),
    -- [230] キングドラ
    (230, 0,  75), (230, 1,  95), (230, 2,  95), (230, 3,  95), (230, 4,  95), (230, 5,  85),
    -- [231] ゴマゾウ
    (231, 0,  90), (231, 1,  60), (231, 2,  60), (231, 3,  40), (231, 4,  40), (231, 5,  40),
    -- [232] ドンファン
    (232, 0,  90), (232, 1, 120), (232, 2, 120), (232, 3,  60), (232, 4,  60), (232, 5,  50),
    -- [233] ポリゴン２
    (233, 0,  85), (233, 1,  80), (233, 2,  90), (233, 3, 105), (233, 4,  95), (233, 5,  60),
    -- [234] オドシシ
    (234, 0,  73), (234, 1,  95), (234, 2,  62), (234, 3,  85), (234, 4,  65), (234, 5,  85),
    -- [235] ドーブル
    (235, 0,  55), (235, 1,  20), (235, 2,  35), (235, 3,  20), (235, 4,  45), (235, 5,  75),
    -- [236] バルキー
    (236, 0,  35), (236, 1,  35), (236, 2,  35), (236, 3,  35), (236, 4,  35), (236, 5,  35),
    -- [237] カポエラー
    (237, 0,  50), (237, 1,  95), (237, 2,  95), (237, 3,  35), (237, 4, 110), (237, 5,  70),
    -- [238] ムチュール
    (238, 0,  45), (238, 1,  30), (238, 2,  15), (238, 3,  85), (238, 4,  65), (238, 5,  65),
    -- [239] エレキッド
    (239, 0,  45), (239, 1,  63), (239, 2,  37), (239, 3,  65), (239, 4,  55), (239, 5,  95),
    -- [240] ブビィ
    (240, 0,  45), (240, 1,  75), (240, 2,  37), (240, 3,  70), (240, 4,  55), (240, 5,  83),
    -- [241] ミルタンク
    (241, 0,  95), (241, 1,  80), (241, 2, 105), (241, 3,  40), (241, 4,  70), (241, 5, 100),
    -- [242] ハピナス
    (242, 0, 255), (242, 1,  10), (242, 2,  10), (242, 3,  75), (242, 4, 135), (242, 5,  55),
    -- [243] ライコウ
    (243, 0,  90), (243, 1,  85), (243, 2,  75), (243, 3, 115), (243, 4, 100), (243, 5, 115),
    -- [244] エンテイ
    (244, 0, 115), (244, 1, 115), (244, 2,  85), (244, 3,  90), (244, 4,  75), (244, 5, 100),
    -- [245] スイクン
    (245, 0, 100), (245, 1,  75), (245, 2, 115), (245, 3,  90), (245, 4, 115), (245, 5,  85),
    -- [246] ヨーギラス
    (246, 0,  50), (246, 1,  64), (246, 2,  50), (246, 3,  45), (246, 4,  50), (246, 5,  41),
    -- [247] サナギラス
    (247, 0,  70), (247, 1,  84), (247, 2,  70), (247, 3,  65), (247, 4,  70), (247, 5,  51),
    -- [248] バンギラス
    (248, 0, 100), (248, 1, 134), (248, 2, 110), (248, 3,  95), (248, 4, 100), (248, 5,  61),
    -- [249] ルギア
    (249, 0, 106), (249, 1,  90), (249, 2, 130), (249, 3,  90), (249, 4, 154), (249, 5, 110),
    -- [250] ホウオウ
    (250, 0, 106), (250, 1, 130), (250, 2,  90), (250, 3, 110), (250, 4, 154), (250, 5,  90),
    -- [251] セレビィ
    (251, 0, 100), (251, 1, 100), (251, 2, 100), (251, 3, 100), (251, 4, 100), (251, 5, 100),
    -- [252] キモリ
    (252, 0,  40), (252, 1,  45), (252, 2,  35), (252, 3,  65), (252, 4,  55), (252, 5,  70),
    -- [253] ジュプトル
    (253, 0,  50), (253, 1,  65), (253, 2,  45), (253, 3,  85), (253, 4,  65), (253, 5,  95),
    -- [254] ジュカイン
    (254, 0,  70), (254, 1,  85), (254, 2,  65), (254, 3, 105), (254, 4,  85), (254, 5, 120),
    -- [255] アチャモ
    (255, 0,  45), (255, 1,  60), (255, 2,  40), (255, 3,  70), (255, 4,  50), (255, 5,  45),
    -- [256] ワカシャモ
    (256, 0,  60), (256, 1,  85), (256, 2,  60), (256, 3,  85), (256, 4,  60), (256, 5,  55),
    -- [257] バシャーモ
    (257, 0,  80), (257, 1, 120), (257, 2,  70), (257, 3, 110), (257, 4,  70), (257, 5,  80),
    -- [258] ミズゴロウ
    (258, 0,  50), (258, 1,  70), (258, 2,  50), (258, 3,  50), (258, 4,  50), (258, 5,  40),
    -- [259] ヌマクロー
    (259, 0,  70), (259, 1,  85), (259, 2,  70), (259, 3,  60), (259, 4,  70), (259, 5,  50),
    -- [260] ラグラージ
    (260, 0, 100), (260, 1, 110), (260, 2,  90), (260, 3,  85), (260, 4,  90), (260, 5,  60),
    -- [261] ポチエナ
    (261, 0,  35), (261, 1,  55), (261, 2,  35), (261, 3,  30), (261, 4,  30), (261, 5,  35),
    -- [262] グラエナ
    (262, 0,  70), (262, 1,  90), (262, 2,  70), (262, 3,  60), (262, 4,  60), (262, 5,  70),
    -- [263] ジグザグマ
    (263, 0,  38), (263, 1,  30), (263, 2,  41), (263, 3,  30), (263, 4,  41), (263, 5,  60),
    -- [264] マッスグマ
    (264, 0,  78), (264, 1,  70), (264, 2,  61), (264, 3,  50), (264, 4,  61), (264, 5, 100),
    -- [265] ケムッソ
    (265, 0,  45), (265, 1,  45), (265, 2,  35), (265, 3,  20), (265, 4,  30), (265, 5,  20),
    -- [266] カラサリス
    (266, 0,  50), (266, 1,  35), (266, 2,  55), (266, 3,  25), (266, 4,  25), (266, 5,  15),
    -- [267] アゲハント
    (267, 0,  60), (267, 1,  70), (267, 2,  50), (267, 3,  90), (267, 4,  50), (267, 5,  65),
    -- [268] マユルド
    (268, 0,  50), (268, 1,  35), (268, 2,  55), (268, 3,  25), (268, 4,  25), (268, 5,  15),
    -- [269] ドクケイル
    (269, 0,  60), (269, 1,  50), (269, 2,  70), (269, 3,  50), (269, 4,  90), (269, 5,  65),
    -- [270] ハスボー
    (270, 0,  40), (270, 1,  30), (270, 2,  30), (270, 3,  40), (270, 4,  50), (270, 5,  30),
    -- [271] ハスブレロ
    (271, 0,  60), (271, 1,  50), (271, 2,  50), (271, 3,  60), (271, 4,  70), (271, 5,  50),
    -- [272] ルンパッパ
    (272, 0,  80), (272, 1,  70), (272, 2,  70), (272, 3,  90), (272, 4, 100), (272, 5,  70),
    -- [273] タネボー
    (273, 0,  40), (273, 1,  40), (273, 2,  50), (273, 3,  30), (273, 4,  30), (273, 5,  30),
    -- [274] コノハナ
    (274, 0,  70), (274, 1,  70), (274, 2,  40), (274, 3,  60), (274, 4,  40), (274, 5,  60),
    -- [275] ダーテング
    (275, 0,  90), (275, 1, 100), (275, 2,  60), (275, 3,  90), (275, 4,  60), (275, 5,  80),
    -- [276] スバメ
    (276, 0,  40), (276, 1,  55), (276, 2,  30), (276, 3,  30), (276, 4,  30), (276, 5,  85),
    -- [277] オオスバメ
    (277, 0,  60), (277, 1,  85), (277, 2,  60), (277, 3,  50), (277, 4,  50), (277, 5, 125),
    -- [278] キャモメ
    (278, 0,  40), (278, 1,  30), (278, 2,  30), (278, 3,  55), (278, 4,  30), (278, 5,  85),
    -- [279] ペリッパー
    (279, 0,  60), (279, 1,  50), (279, 2, 100), (279, 3,  85), (279, 4,  70), (279, 5,  65),
    -- [280] ラルトス
    (280, 0,  28), (280, 1,  25), (280, 2,  25), (280, 3,  45), (280, 4,  35), (280, 5,  40),
    -- [281] キルリア
    (281, 0,  38), (281, 1,  35), (281, 2,  35), (281, 3,  65), (281, 4,  55), (281, 5,  50),
    -- [282] サーナイト
    (282, 0,  68), (282, 1,  65), (282, 2,  65), (282, 3, 125), (282, 4, 115), (282, 5,  80),
    -- [283] アメタマ
    (283, 0,  40), (283, 1,  30), (283, 2,  32), (283, 3,  50), (283, 4,  52), (283, 5,  65),
    -- [284] アメモース
    (284, 0,  70), (284, 1,  60), (284, 2,  62), (284, 3,  80), (284, 4,  82), (284, 5,  60),
    -- [285] キノココ
    (285, 0,  60), (285, 1,  40), (285, 2,  60), (285, 3,  40), (285, 4,  60), (285, 5,  35),
    -- [286] キノガッサ
    (286, 0,  60), (286, 1, 130), (286, 2,  80), (286, 3,  60), (286, 4,  60), (286, 5,  70),
    -- [287] ナマケロ
    (287, 0,  60), (287, 1,  60), (287, 2,  60), (287, 3,  35), (287, 4,  35), (287, 5,  30),
    -- [288] ヤルキモノ
    (288, 0,  80), (288, 1,  80), (288, 2,  80), (288, 3,  55), (288, 4,  55), (288, 5,  90),
    -- [289] ケッキング
    (289, 0, 150), (289, 1, 160), (289, 2, 100), (289, 3,  95), (289, 4,  65), (289, 5, 100),
    -- [290] ツチニン
    (290, 0,  31), (290, 1,  45), (290, 2,  90), (290, 3,  30), (290, 4,  30), (290, 5,  40),
    -- [291] テッカニン
    (291, 0,  61), (291, 1,  90), (291, 2,  45), (291, 3,  50), (291, 4,  50), (291, 5, 160),
    -- [292] ヌケニン
    (292, 0,   1), (292, 1,  90), (292, 2,  45), (292, 3,  30), (292, 4,  30), (292, 5,  40),
    -- [293] ゴニョニョ
    (293, 0,  64), (293, 1,  51), (293, 2,  23), (293, 3,  51), (293, 4,  23), (293, 5,  28),
    -- [294] ドゴーム
    (294, 0,  84), (294, 1,  71), (294, 2,  43), (294, 3,  71), (294, 4,  43), (294, 5,  48),
    -- [295] バクオング
    (295, 0, 104), (295, 1,  91), (295, 2,  63), (295, 3,  91), (295, 4,  63), (295, 5,  68),
    -- [296] マクノシタ
    (296, 0,  72), (296, 1,  60), (296, 2,  30), (296, 3,  20), (296, 4,  30), (296, 5,  25),
    -- [297] ハリテヤマ
    (297, 0, 144), (297, 1, 120), (297, 2,  60), (297, 3,  40), (297, 4,  60), (297, 5,  50),
    -- [298] ルリリ
    (298, 0,  50), (298, 1,  20), (298, 2,  40), (298, 3,  20), (298, 4,  40), (298, 5,  20),
    -- [299] ノズパス
    (299, 0,  30), (299, 1,  45), (299, 2, 135), (299, 3,  45), (299, 4,  90), (299, 5,  30),
    -- [300] エネコ
    (300, 0,  50), (300, 1,  45), (300, 2,  45), (300, 3,  35), (300, 4,  35), (300, 5,  50),
    -- [301] エネコロロ
    (301, 0,  70), (301, 1,  65), (301, 2,  65), (301, 3,  55), (301, 4,  55), (301, 5,  70),
    -- [302] ヤミラミ
    (302, 0,  50), (302, 1,  75), (302, 2,  75), (302, 3,  65), (302, 4,  65), (302, 5,  50),
    -- [303] クチート
    (303, 0,  50), (303, 1,  85), (303, 2,  85), (303, 3,  55), (303, 4,  55), (303, 5,  50),
    -- [304] ココドラ
    (304, 0,  50), (304, 1,  70), (304, 2, 100), (304, 3,  40), (304, 4,  40), (304, 5,  30),
    -- [305] コドラ
    (305, 0,  60), (305, 1,  90), (305, 2, 140), (305, 3,  50), (305, 4,  50), (305, 5,  40),
    -- [306] ボスゴドラ
    (306, 0,  70), (306, 1, 110), (306, 2, 180), (306, 3,  60), (306, 4,  60), (306, 5,  50),
    -- [307] アサナン
    (307, 0,  30), (307, 1,  40), (307, 2,  55), (307, 3,  40), (307, 4,  55), (307, 5,  60),
    -- [308] チャーレム
    (308, 0,  60), (308, 1,  60), (308, 2,  75), (308, 3,  60), (308, 4,  75), (308, 5,  80),
    -- [309] ラクライ
    (309, 0,  40), (309, 1,  45), (309, 2,  40), (309, 3,  65), (309, 4,  40), (309, 5,  65),
    -- [310] ライボルト
    (310, 0,  70), (310, 1,  75), (310, 2,  60), (310, 3, 105), (310, 4,  60), (310, 5, 105),
    -- [311] プラスル
    (311, 0,  60), (311, 1,  50), (311, 2,  40), (311, 3,  85), (311, 4,  75), (311, 5,  95),
    -- [312] マイナン
    (312, 0,  60), (312, 1,  40), (312, 2,  50), (312, 3,  75), (312, 4,  85), (312, 5,  95),
    -- [313] バルビート
    (313, 0,  65), (313, 1,  73), (313, 2,  55), (313, 3,  47), (313, 4,  75), (313, 5,  85),
    -- [314] イルミーゼ
    (314, 0,  65), (314, 1,  47), (314, 2,  55), (314, 3,  73), (314, 4,  75), (314, 5,  85),
    -- [315] ロゼリア
    (315, 0,  50), (315, 1,  60), (315, 2,  45), (315, 3, 100), (315, 4,  80), (315, 5,  65),
    -- [316] ゴクリン
    (316, 0,  70), (316, 1,  43), (316, 2,  53), (316, 3,  43), (316, 4,  53), (316, 5,  40),
    -- [317] マルノーム
    (317, 0, 100), (317, 1,  73), (317, 2,  83), (317, 3,  73), (317, 4,  83), (317, 5,  55),
    -- [318] キバニア
    (318, 0,  45), (318, 1,  90), (318, 2,  20), (318, 3,  65), (318, 4,  20), (318, 5,  65),
    -- [319] サメハダー
    (319, 0,  70), (319, 1, 120), (319, 2,  40), (319, 3,  95), (319, 4,  40), (319, 5,  95),
    -- [320] ホエルコ
    (320, 0, 130), (320, 1,  70), (320, 2,  35), (320, 3,  70), (320, 4,  35), (320, 5,  60),
    -- [321] ホエルオー
    (321, 0, 170), (321, 1,  90), (321, 2,  45), (321, 3,  90), (321, 4,  45), (321, 5,  60),
    -- [322] ドンメル
    (322, 0,  60), (322, 1,  60), (322, 2,  40), (322, 3,  65), (322, 4,  45), (322, 5,  35),
    -- [323] バクーダ
    (323, 0,  70), (323, 1, 100), (323, 2,  70), (323, 3, 105), (323, 4,  75), (323, 5,  40),
    -- [324] コータス
    (324, 0,  70), (324, 1,  85), (324, 2, 140), (324, 3,  85), (324, 4,  70), (324, 5,  20),
    -- [325] バネブー
    (325, 0,  60), (325, 1,  25), (325, 2,  35), (325, 3,  70), (325, 4,  80), (325, 5,  60),
    -- [326] ブーピッグ
    (326, 0,  80), (326, 1,  45), (326, 2,  65), (326, 3,  90), (326, 4, 110), (326, 5,  80),
    -- [327] パッチール
    (327, 0,  60), (327, 1,  60), (327, 2,  60), (327, 3,  60), (327, 4,  60), (327, 5,  60),
    -- [328] ナックラー
    (328, 0,  45), (328, 1, 100), (328, 2,  45), (328, 3,  45), (328, 4,  45), (328, 5,  10),
    -- [329] ビブラーバ
    (329, 0,  50), (329, 1,  70), (329, 2,  50), (329, 3,  50), (329, 4,  50), (329, 5,  70),
    -- [330] フライゴン
    (330, 0,  80), (330, 1, 100), (330, 2,  80), (330, 3,  80), (330, 4,  80), (330, 5, 100),
    -- [331] サボネア
    (331, 0,  50), (331, 1,  85), (331, 2,  40), (331, 3,  85), (331, 4,  40), (331, 5,  35),
    -- [332] ノクタス
    (332, 0,  70), (332, 1, 115), (332, 2,  60), (332, 3, 115), (332, 4,  60), (332, 5,  55),
    -- [333] チルット
    (333, 0,  45), (333, 1,  40), (333, 2,  60), (333, 3,  40), (333, 4,  75), (333, 5,  50),
    -- [334] チルタリス
    (334, 0,  75), (334, 1,  70), (334, 2,  90), (334, 3,  70), (334, 4, 105), (334, 5,  80),
    -- [335] ザングース
    (335, 0,  73), (335, 1, 115), (335, 2,  60), (335, 3,  60), (335, 4,  60), (335, 5,  90),
    -- [336] ハブネーク
    (336, 0,  73), (336, 1, 100), (336, 2,  60), (336, 3, 100), (336, 4,  60), (336, 5,  65),
    -- [337] ルナトーン
    (337, 0,  70), (337, 1,  55), (337, 2,  65), (337, 3,  95), (337, 4,  85), (337, 5,  70),
    -- [338] ソルロック
    (338, 0,  70), (338, 1,  95), (338, 2,  85), (338, 3,  55), (338, 4,  65), (338, 5,  70),
    -- [339] ドジョッチ
    (339, 0,  50), (339, 1,  48), (339, 2,  43), (339, 3,  46), (339, 4,  41), (339, 5,  60),
    -- [340] ナマズン
    (340, 0, 110), (340, 1,  78), (340, 2,  73), (340, 3,  76), (340, 4,  71), (340, 5,  60),
    -- [341] ヘイガニ
    (341, 0,  43), (341, 1,  80), (341, 2,  65), (341, 3,  50), (341, 4,  35), (341, 5,  35),
    -- [342] シザリガー
    (342, 0,  63), (342, 1, 120), (342, 2,  85), (342, 3,  90), (342, 4,  55), (342, 5,  55),
    -- [343] ヤジロン
    (343, 0,  40), (343, 1,  40), (343, 2,  55), (343, 3,  40), (343, 4,  70), (343, 5,  55),
    -- [344] ネンドール
    (344, 0,  60), (344, 1,  70), (344, 2, 105), (344, 3,  70), (344, 4, 120), (344, 5,  75),
    -- [345] リリーラ
    (345, 0,  66), (345, 1,  41), (345, 2,  77), (345, 3,  61), (345, 4,  87), (345, 5,  23),
    -- [346] ユレイドル
    (346, 0,  86), (346, 1,  81), (346, 2,  97), (346, 3,  81), (346, 4, 107), (346, 5,  43),
    -- [347] アノプス
    (347, 0,  45), (347, 1,  95), (347, 2,  50), (347, 3,  40), (347, 4,  50), (347, 5,  75),
    -- [348] アーマルド
    (348, 0,  75), (348, 1, 125), (348, 2, 100), (348, 3,  70), (348, 4,  80), (348, 5,  45),
    -- [349] ヒンバス
    (349, 0,  20), (349, 1,  15), (349, 2,  20), (349, 3,  10), (349, 4,  55), (349, 5,  80),
    -- [350] ミロカロス
    (350, 0,  95), (350, 1,  60), (350, 2,  79), (350, 3, 100), (350, 4, 125), (350, 5,  81),
    -- [351] ポワルン
    (351, 0,  70), (351, 1,  70), (351, 2,  70), (351, 3,  70), (351, 4,  70), (351, 5,  70),
    -- [351] ポワルン たいようのすがた
    (352, 0,  70), (352, 1,  70), (352, 2,  70), (352, 3,  70), (352, 4,  70), (352, 5,  70),
    -- [351] ポワルン あまみずのすがた
    (353, 0,  70), (353, 1,  70), (353, 2,  70), (353, 3,  70), (353, 4,  70), (353, 5,  70),
    -- [351] ポワルン ゆきぐものすがた
    (354, 0,  70), (354, 1,  70), (354, 2,  70), (354, 3,  70), (354, 4,  70), (354, 5,  70),
    -- [352] カクレオン
    (355, 0,  60), (355, 1,  90), (355, 2,  70), (355, 3,  60), (355, 4, 120), (355, 5,  40),
    -- [353] カゲボウズ
    (356, 0,  44), (356, 1,  75), (356, 2,  35), (356, 3,  63), (356, 4,  33), (356, 5,  45),
    -- [354] ジュペッタ
    (357, 0,  64), (357, 1, 115), (357, 2,  65), (357, 3,  83), (357, 4,  63), (357, 5,  65),
    -- [355] ヨマワル
    (358, 0,  20), (358, 1,  40), (358, 2,  90), (358, 3,  30), (358, 4,  90), (358, 5,  25),
    -- [356] サマヨール
    (359, 0,  40), (359, 1,  70), (359, 2, 130), (359, 3,  60), (359, 4, 130), (359, 5,  25),
    -- [357] トロピウス
    (360, 0,  99), (360, 1,  68), (360, 2,  83), (360, 3,  72), (360, 4,  87), (360, 5,  51),
    -- [358] チリーン
    (361, 0,  65), (361, 1,  50), (361, 2,  70), (361, 3,  95), (361, 4,  80), (361, 5,  65),
    -- [359] アブソル
    (362, 0,  65), (362, 1, 130), (362, 2,  60), (362, 3,  75), (362, 4,  60), (362, 5,  75),
    -- [360] ソーナノ
    (363, 0,  95), (363, 1,  23), (363, 2,  48), (363, 3,  23), (363, 4,  48), (363, 5,  23),
    -- [361] ユキワラシ
    (364, 0,  50), (364, 1,  50), (364, 2,  50), (364, 3,  50), (364, 4,  50), (364, 5,  50),
    -- [362] オニゴーリ
    (365, 0,  80), (365, 1,  80), (365, 2,  80), (365, 3,  80), (365, 4,  80), (365, 5,  80),
    -- [363] タマザラシ
    (366, 0,  70), (366, 1,  40), (366, 2,  50), (366, 3,  55), (366, 4,  50), (366, 5,  25),
    -- [364] トドグラー
    (367, 0,  90), (367, 1,  60), (367, 2,  70), (367, 3,  75), (367, 4,  70), (367, 5,  45),
    -- [365] トドゼルガ
    (368, 0, 110), (368, 1,  80), (368, 2,  90), (368, 3,  95), (368, 4,  90), (368, 5,  65),
    -- [366] パールル
    (369, 0,  35), (369, 1,  64), (369, 2,  85), (369, 3,  74), (369, 4,  55), (369, 5,  32),
    -- [367] ハンテール
    (370, 0,  55), (370, 1, 104), (370, 2, 105), (370, 3,  94), (370, 4,  75), (370, 5,  52),
    -- [368] サクラビス
    (371, 0,  55), (371, 1,  84), (371, 2, 105), (371, 3, 114), (371, 4,  75), (371, 5,  52),
    -- [369] ジーランス
    (372, 0, 100), (372, 1,  90), (372, 2, 130), (372, 3,  45), (372, 4,  65), (372, 5,  55),
    -- [370] ラブカス
    (373, 0,  43), (373, 1,  30), (373, 2,  55), (373, 3,  40), (373, 4,  65), (373, 5,  97),
    -- [371] タツベイ
    (374, 0,  45), (374, 1,  75), (374, 2,  60), (374, 3,  40), (374, 4,  30), (374, 5,  50),
    -- [372] コモルー
    (375, 0,  65), (375, 1,  95), (375, 2, 100), (375, 3,  60), (375, 4,  50), (375, 5,  50),
    -- [373] ボーマンダ
    (376, 0,  95), (376, 1, 135), (376, 2,  80), (376, 3, 110), (376, 4,  80), (376, 5, 100),
    -- [374] ダンバル
    (377, 0,  40), (377, 1,  55), (377, 2,  80), (377, 3,  35), (377, 4,  60), (377, 5,  30),
    -- [375] メタング
    (378, 0,  60), (378, 1,  75), (378, 2, 100), (378, 3,  55), (378, 4,  80), (378, 5,  50),
    -- [376] メタグロス
    (379, 0,  80), (379, 1, 135), (379, 2, 130), (379, 3,  95), (379, 4,  90), (379, 5,  70),
    -- [377] レジロック
    (380, 0,  80), (380, 1, 100), (380, 2, 200), (380, 3,  50), (380, 4, 100), (380, 5,  50),
    -- [378] レジアイス
    (381, 0,  80), (381, 1,  50), (381, 2, 100), (381, 3, 100), (381, 4, 200), (381, 5,  50),
    -- [379] レジスチル
    (382, 0,  80), (382, 1,  75), (382, 2, 150), (382, 3,  75), (382, 4, 150), (382, 5,  50),
    -- [380] ラティアス
    (383, 0,  80), (383, 1,  80), (383, 2,  90), (383, 3, 110), (383, 4, 130), (383, 5, 110),
    -- [381] ラティオス
    (384, 0,  80), (384, 1,  90), (384, 2,  80), (384, 3, 130), (384, 4, 110), (384, 5, 110),
    -- [382] カイオーガ
    (385, 0, 100), (385, 1, 100), (385, 2,  90), (385, 3, 150), (385, 4, 140), (385, 5,  90),
    -- [383] グラードン
    (386, 0, 100), (386, 1, 150), (386, 2, 140), (386, 3, 100), (386, 4,  90), (386, 5,  90),
    -- [384] レックウザ
    (387, 0, 105), (387, 1, 150), (387, 2,  90), (387, 3, 150), (387, 4,  90), (387, 5,  95),
    -- [385] ジラーチ
    (388, 0, 100), (388, 1, 100), (388, 2, 100), (388, 3, 100), (388, 4, 100), (388, 5, 100),
    -- [386] デオキシス ノーマルフォルム
    (389, 0,  50), (389, 1, 150), (389, 2,  50), (389, 3, 150), (389, 4,  50), (389, 5, 150),
    -- [386] デオキシス アタックフォルム
    (390, 0,  50), (390, 1, 180), (390, 2,  20), (390, 3, 180), (390, 4,  20), (390, 5, 150),
    -- [386] デオキシス ディフェンスフォルム
    (391, 0,  50), (391, 1,  70), (391, 2, 160), (391, 3,  70), (391, 4, 160), (391, 5,  90),
    -- [386] デオキシス スピードフォルム
    (392, 0,  50), (392, 1,  95), (392, 2,  90), (392, 3,  95), (392, 4,  90), (392, 5, 180);
